[
  {
    "name": "Homemade Hamburger Buns",
    "description": "I've gotten a thousand request for these. We're going to make our own, and not only are these going to be the perfect shape, they're going to taste way better than anything that comes out of a plastic bag. The total time takes almost 4 hours, but the actual amount of work involved is maybe 10 minutes.",
    "recipeInstructions": [
      "Line a baking sheet with a silicone mat or parchment paper.",
      "Place yeast into bowl of a large stand mixer; whisk in 1/2 cup flour and warm water until smooth. Let stand until mixture is foamy, 10 to 15 minutes.",
      "Whisk 1 egg, melted butter, sugar, and salt thoroughly into yeast mixture. Add remaining flour (about 3 cups).",
      "Fit a dough hook onto stand mixer and knead the dough on low speed until soft and sticky, 5 to 6 minutes. Scrape sides if needed. Poke and prod the dough with a silicone spatula; if large amounts of dough stick to the spatula, add a little more flour.",
      "Transfer dough onto a floured work surface; dough will be sticky and elastic but not stick to your fingers. Form the dough lightly into a smooth, round shape, gently tucking loose ends underneath.",
      "Wipe out stand mixer bowl, drizzle olive oil into the bowl, and turn dough over in the bowl several times to coat surface thinly with oil. Cover bowl with aluminum foil. Let dough rise in a warm place until doubled, about 2 hours.",
      "Transfer dough to a floured work surface and pat to flatten bubbles and form into a slightly rounded rectangle of dough about 5x10 inches and about 1/2 inch thick. Dust dough lightly with flour if needed. Cut dough into 8 equal pieces. Form each piece into a round shape, gently tucking ends underneath as before.",
      "Use your hands to gently pat and stretch the dough rounds into flat disc shapes about 1/2 inch thick. Arrange buns about 1/2 inch apart on prepared baking sheet. Dust buns very lightly with flour. Drape a piece of plastic wrap over the baking sheet (do not seal tightly). Let buns rise until doubled, about 1 hour.",
      "Preheat oven to 375 degrees F (190 degrees C).",
      "Beat 1 egg with milk in a small bowl, using a fork, until mixture is thoroughly combined. Very gently and lightly brush tops of buns with egg wash without deflating the risen dough. Sprinkle each bun with sesame seeds.",
      "Bake in the preheated oven until lightly browned on top, 15 to 17 minutes. Buns will stick together slightly where they touch. Let cool completely, tear the buns apart, and slice in half crosswise to serve."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 225,
    "energyContentCalories": 291.7,
    "fatContentGrams": 7.0,
    "carbohydrateContentGrams": 48.6,
    "proteinContentGrams": 7.9,
    "cholesterolContentMilligrams": 58.1,
    "sodiumContentMilligrams": 414.8,
    "ingredients": [
      [
        1.0,
        "(.25 ounce) package active dry yeast (such as fleischmann's activedry yeast®) (unit)"
      ],
      [
        454.0,
        "all-purpose flour (g)"
      ],
      [
        236.5,
        "warm water (105 degrees f/41 degrees c) (mL)"
      ],
      [
        1.0,
        "large egg (unit)"
      ],
      [
        45.0,
        "butter, melted (mL)"
      ],
      [
        45.0,
        "sugar (mL)"
      ],
      [
        6.25,
        "salt (mL)"
      ],
      [
        5.0,
        "olive oil (mL)"
      ],
      [
        1.0,
        "egg, beaten (unit)"
      ],
      [
        15.0,
        "milk (mL)"
      ],
      [
        5.0,
        "sesame seeds (mL)"
      ]
    ]
  },
  {
    "name": "Super Easy Egg Casserole",
    "description": "Another husband-approved recipe. Made a couple times recently because of how easy it is to make! This recipe is easy to double or triple, but you may have to cook a bit longer if doing so.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
      "Stir Cheddar cheese, eggs, bacon, bread, red bell pepper, green onion, milk, garlic, salt, and black pepper together in a bowl until well-combined; pour into prepared baking dish.",
      "Bake in the preheated oven until eggs are set, 20 to 25 minutes."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 35,
    "energyContentCalories": 340.4,
    "fatContentGrams": 23.2,
    "carbohydrateContentGrams": 9.3,
    "proteinContentGrams": 23.2,
    "cholesterolContentMilligrams": 324.7,
    "sodiumContentMilligrams": 728.3,
    "ingredients": [
      [
        236.5,
        "shredded cheddar cheese (mL)"
      ],
      [
        6.0,
        " large eggs eggs, whisked (unit)"
      ],
      [
        6.0,
        "slices bacon, diced (unit)"
      ],
      [
        2.0,
        "slices bread, cubed (unit)"
      ],
      [
        0.3333,
        "red bell pepper, diced (unit)"
      ],
      [
        2.0,
        "eaches green onions, chopped (unit)"
      ],
      [
        45.0,
        "milk (mL)"
      ],
      [
        2.5,
        "minced garlic (mL)"
      ],
      [
        0.31,
        "salt and ground black pepper (mL)"
      ]
    ]
  },
  {
    "name": "No-Churn Keto Ice Cream",
    "description": "Quick to make and no ice cream machine needed! After trying different variations of ingredients, I finally figured out a combination that produced a smooth and creamy texture, yet didn't freeze rock-hard like most no-churn ice cream can. The vodka is optional, however it really helps keep the ice cream scoopable and you don't taste it!",
    "recipeInstructions": [
      "Combine cream, sweetener, vodka, vanilla extract, xanthan gum, and salt in a wide-mouth pint-sized jar. Blend cream mixture with an immersion blender in an up-and-down motion until cream has thickened and soft peaks have formed, 60 to 75 seconds. Cover jar and place in the freezer for 3 to 4 hours, stirring every 30 to 40 minutes."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 190,
    "energyContentCalories": 291.0,
    "fatContentGrams": 29.4,
    "carbohydrateContentGrams": 3.2,
    "proteinContentGrams": 1.6,
    "cholesterolContentMilligrams": 108.7,
    "sodiumContentMilligrams": 91.7,
    "ingredients": [
      [
        236.5,
        "heavy whipping cream (mL)"
      ],
      [
        30.0,
        "powdered zero-calorie sweetener (such as swerve®) (mL)"
      ],
      [
        15.0,
        "vodka (mL)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        1.25,
        "xanthan gum (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ]
    ]
  },
  {
    "name": "Tiramisu II",
    "description": "Mascarpone custard layered with whipped cream and rum and coffee soaked ladyfingers.",
    "recipeInstructions": [
      "In a medium saucepan, whisk together egg yolks and sugar until well blended.  Whisk in milk and cook over medium heat, stirring constantly, until mixture boils.  Boil gently for 1 minute, remove from heat and allow to cool slightly.  Cover tightly and chill in refrigerator 1 hour.",
      "In a medium bowl, beat cream with vanilla until stiff peaks form.",
      "Whisk mascarpone into yolk mixture until smooth.",
      "In a small bowl, combine coffee and rum.  Split ladyfingers in half lengthwise and drizzle with coffee mixture.",
      "Arrange half of soaked ladyfingers in bottom of a 7x11 inch dish.  Spread half of mascarpone mixture over ladyfingers, then half of whipped cream over that.  Repeat layers and sprinkle with cocoa.  Cover and refrigerate 4 to 6 hours, until set."
    ],
    "prepTimeMinutes": 35,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 300,
    "energyContentCalories": 387.2,
    "fatContentGrams": 30.5,
    "carbohydrateContentGrams": 22.7,
    "proteinContentGrams": 6.6,
    "cholesterolContentMilligrams": 215.7,
    "sodiumContentMilligrams": 60.0,
    "ingredients": [
      [
        6.0,
        " large egg yolks egg yolks (unit)"
      ],
      [
        177.375,
        "sugar (mL)"
      ],
      [
        157.6745,
        "milk (mL)"
      ],
      [
        295.625,
        "heavy cream (mL)"
      ],
      [
        2.5,
        "vanilla extract (mL)"
      ],
      [
        454.0,
        "mascarpone cheese, at room temperature (g)"
      ],
      [
        59.125,
        "strong brewed coffee, at room temperature (mL)"
      ],
      [
        30.0,
        "rum (mL)"
      ],
      [
        2.0,
        "(3 ounce) packages ladyfinger cookies (unit)"
      ],
      [
        15.0,
        "cocoa powder (mL)"
      ]
    ]
  },
  {
    "name": "Spaghetti Aglio e Olio",
    "description": "No two spaghetti aglio e olio recipes are alike, but this one is pretty true to the classic method. The key is slowly toasting the garlic slices to a perfect golden-brown in the olive oil. If it's too light, you don't get the full flavor and if it's too dark it gets bitter. My advice? Do it perfectly.",
    "recipeInstructions": [
      "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and transfer to a pasta bowl.",
      "Combine garlic and olive oil in a cold skillet. Cook over medium heat to slowly toast garlic, about 10 minutes. Reduce heat to medium-low when olive oil begins to bubble. Cook and stir until garlic is golden brown, about another 5 minutes. Remove from heat.",
      "Stir red pepper flakes, black pepper, and salt into the pasta. Pour in olive oil and garlic, and sprinkle on Italian parsley and half of the Parmigiano-Reggiano cheese; stir until combined.",
      "Serve pasta topped with the remaining Parmigiano-Reggiano cheese."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 22,
    "totalTimeMinutes": 32,
    "energyContentCalories": 754.6,
    "fatContentGrams": 34.5,
    "carbohydrateContentGrams": 87.4,
    "proteinContentGrams": 22.9,
    "cholesterolContentMilligrams": 17.6,
    "sodiumContentMilligrams": 354.8,
    "ingredients": [
      [
        454.0,
        "uncooked spaghetti (g)"
      ],
      [
        6.0,
        "cloves garlic, thinly sliced (unit)"
      ],
      [
        118.25,
        "olive oil (mL)"
      ],
      [
        1.25,
        "red pepper flakes (mL)"
      ],
      [
        0.31,
        "salt and freshly ground black pepper (mL)"
      ],
      [
        59.125,
        "chopped fresh italian parsley (mL)"
      ],
      [
        236.5,
        "finely grated parmigiano-reggiano cheese (mL)"
      ]
    ]
  },
  {
    "name": "Orange Banana Smoothie",
    "description": "Filling enough to have as a breakfast - I recommend it!",
    "recipeInstructions": [
      "In a blender, combine milk, oranges, banana, sugar, salt and yogurt. Blend for about 1 minute. Insert ice cubes, and blend until smooth. Pour into glasses and serve."
    ],
    "prepTimeMinutes": 5,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 5,
    "energyContentCalories": 340.2,
    "fatContentGrams": 2.9,
    "carbohydrateContentGrams": 73.7,
    "proteinContentGrams": 9.1,
    "cholesterolContentMilligrams": 10.7,
    "sodiumContentMilligrams": 90.2,
    "ingredients": [
      [
        236.5,
        "cold milk (mL)"
      ],
      [
        2.0,
        "fruit, (2-5/8\" dia, sphere)s oranges, peeled and segmented (unit)"
      ],
      [
        1.0,
        "banana (unit)"
      ],
      [
        59.125,
        "sugar (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        0.5,
        "(8 ounce) container vanilla fat-free yogurt (unit)"
      ],
      [
        4.0,
        "cubes  ice (unit)"
      ]
    ]
  },
  {
    "name": "Mom's Beef Shish Kabobs",
    "description": "My Mom has cooked this recipe for as long as I remember. Now that I live on my own, I can't wait to go back home over the holidays to have this excellent dish. Mom would probably be upset that I gave it away, but it is so delicious that I think everyone should have a chance to experience it. Technically shish kabobs use lamb, so these should be called beef kabobs, but this is the family recipe and what we call it.",
    "recipeInstructions": [
      "Whisk the vegetable oil, soy sauce, lemon juice, mustard, Worcestershire sauce, garlic, black pepper, and salt together in a bowl; pour into a resealable plastic bag. Add the beef, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 8 hours or overnight.",
      "Add the mushrooms to the bag, coat with the marinade, squeeze out excess air, and reseal the bag; marinate in the refrigerator another 8 hours.",
      "Preheat an outdoor grill for high heat, and lightly oil the grate.",
      "Remove the beef and mushrooms from the marinade, shaking off any excess liquid. Pour the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low, and simmer for 10 minutes; set aside for basting.",
      "Thread pieces of green bell pepper, beef, red bell pepper, mushroom, and onion onto metal skewers, repeating until all ingredients are skewered.",
      "Cook the skewers on the preheated grill, turning frequently and brushing generously with the reserved marinade until nicely browned on all sides and the meat is no longer pink in the center, about 15 minutes."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 25,
    "totalTimeMinutes": 1005,
    "energyContentCalories": 417.6,
    "fatContentGrams": 28.6,
    "carbohydrateContentGrams": 15.8,
    "proteinContentGrams": 26.2,
    "cholesterolContentMilligrams": 58.7,
    "sodiumContentMilligrams": 2815.9,
    "ingredients": [
      [
        78.8255,
        "vegetable oil (mL)"
      ],
      [
        118.25,
        "soy sauce (mL)"
      ],
      [
        59.125,
        "lemon juice (mL)"
      ],
      [
        15.0,
        "prepared mustard (mL)"
      ],
      [
        15.0,
        "worcestershire sauce (mL)"
      ],
      [
        1.0,
        "clove garlic, minced (unit)"
      ],
      [
        5.0,
        "coarsely cracked black pepper (mL)"
      ],
      [
        7.5,
        "salt (mL)"
      ],
      [
        680.0,
        "lean beef, cut into 1-inch cubes (g)"
      ],
      [
        16.0,
        "medium (blank)s mushroom caps (unit)"
      ],
      [
        8.0,
        "eaches metal skewers (unit)"
      ],
      [
        2.0,
        "eaches green bell peppers, cut into chunks (unit)"
      ],
      [
        1.0,
        "red bell pepper, cut into chunks (unit)"
      ],
      [
        1.0,
        "large onion, cut into large squares  (unit)"
      ]
    ]
  },
  {
    "name": "Creamy Au Gratin Potatoes",
    "description": "This is my husband's favorite dish, and he considers it a special occasion every time I make it. The creamy cheese sauce and the tender potatoes in this classic French dish combine to make a deliciously addictive experience. It's a great side dish with a roast pork loin or beef tenderloin. Add a green salad and French bread, and you have found the magic path to a man's heart. To avoid lumps in your sauce, add the milk just a little at a time as you stir the flour and butter. Experiment with different cheeses for variety.",
    "recipeInstructions": [
      "Preheat oven to 400 degrees F (200 degrees C). Butter a medium casserole dish.",
      "Layer 1/2 of the potatoes into bottom of the prepared casserole dish. Top with the onion slices, and add the remaining potatoes. Season with salt and pepper to taste.",
      "In a medium-size saucepan, melt butter over medium heat. Mix in the flour and salt, and stir constantly with a whisk for one minute. Stir in milk. Cook until mixture has thickened. Stir in cheese all at once, and continue stirring until melted, about 30 to 60 seconds. Pour cheese over the potatoes, and cover the dish with aluminum foil.",
      "Bake 1 1/2 hours in the preheated oven."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 90,
    "totalTimeMinutes": 120,
    "energyContentCalories": 498.8,
    "fatContentGrams": 25.4,
    "carbohydrateContentGrams": 49.3,
    "proteinContentGrams": 19.8,
    "cholesterolContentMilligrams": 77.2,
    "sodiumContentMilligrams": 683.4,
    "ingredients": [
      [
        4.0,
        "medium (2-1/4\" to 3\" dia, raw)s russet potatoes, sliced into 1/4 inch slices (unit)"
      ],
      [
        1.0,
        "onion, sliced into rings (unit)"
      ],
      [
        1.0,
        "salt and pepper (unit)"
      ],
      [
        45.0,
        "butter (mL)"
      ],
      [
        45.0,
        "all-purpose flour (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        473.0,
        "milk (mL)"
      ],
      [
        354.75,
        "shredded cheddar cheese (mL)"
      ]
    ]
  },
  {
    "name": "Sweet Restaurant Slaw",
    "description": "This tastes just like the cole slaw served at popular fried chicken or fish restaurants. It's excellent with burgers or on top of BBQ'd pork sandwiches, too!!!",
    "recipeInstructions": [
      "Combine the coleslaw mix and onion in a large bowl.",
      "Whisk together the salad dressing, vegetable oil, sugar, vinegar, salt, and poppy seeds in a medium bowl; blend thoroughly. Pour dressing mixture over coleslaw mix and toss to coat. Chill at least 2 hours before serving."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 135,
    "energyContentCalories": 199.8,
    "fatContentGrams": 12.0,
    "carbohydrateContentGrams": 22.5,
    "proteinContentGrams": 0.8,
    "cholesterolContentMilligrams": 11.2,
    "sodiumContentMilligrams": 252.5,
    "ingredients": [
      [
        1.0,
        "(16 ounce) bag coleslaw mix (unit)"
      ],
      [
        30.0,
        "diced onion (mL)"
      ],
      [
        157.6745,
        "creamy salad dressing (such as miracle whip™) (mL)"
      ],
      [
        45.0,
        "vegetable oil (mL)"
      ],
      [
        118.25,
        "sugar (mL)"
      ],
      [
        15.0,
        "white vinegar (mL)"
      ],
      [
        1.25,
        "salt (mL)"
      ],
      [
        2.5,
        "poppy seeds (mL)"
      ]
    ]
  },
  {
    "name": "Emily's Famous Hash Browns",
    "description": "Good old fashioned restaurant-style hash browns. Perfect with hot pepper sauce and ketchup!",
    "recipeInstructions": [
      "Rinse shredded potatoes until water is clear, then drain and squeeze dry. Place shreds in a bowl, and mix in the onion, flour and egg until evenly distributed.",
      "Heat about 1/4 inch of oil in a large heavy skillet over medium-high heat. When oil is sizzling hot, place potatoes into the pan in a 1/2 inch thick layer. Cover the whole bottom of the pan, or make separate piles like pancakes. Cook until nicely browned on the bottom, then flip over and brown on the other side. It should take at least 5 minutes per side.  If you are cooking them in one big piece, it can be cut into quarters for easier flipping.",
      "Remove from pan, and drain on paper towels. Season with salt and pepper and serve immediately."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 35,
    "energyContentCalories": 183.0,
    "fatContentGrams": 6.9,
    "carbohydrateContentGrams": 26.1,
    "proteinContentGrams": 4.7,
    "cholesterolContentMilligrams": 46.5,
    "sodiumContentMilligrams": 24.5,
    "ingredients": [
      [
        2.0,
        "medium russet potatoes, shredded (unit)"
      ],
      [
        0.5,
        "medium onion, finely chopped (unit)"
      ],
      [
        59.125,
        "all-purpose flour (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        236.5,
        "oil for frying (mL)"
      ],
      [
        0.31,
        "salt and pepper (mL)"
      ]
    ]
  },
  {
    "name": "Chow Mein Noodle Casserole",
    "description": "This is a very tasty dish that even my kids love! It can easily be cut in half. It uses soy sauce and chow mein noodles to give it an Asian flair.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "In a large skillet over medium high heat, saute the ground beef for 5 minutes. Add the onion and celery and saute for 5 more minutes.",
      "In a separate medium bowl, combine the almonds, rice, soup, water and soy sauce. Mix together well and add to the beef mixture. Place this into a lightly greased 9x13 inch baking dish. Top with chow mein noodles.",
      "Bake at 350 degrees F (175 degrees C) for 20 minutes."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 40,
    "energyContentCalories": 597.3,
    "fatContentGrams": 35.5,
    "carbohydrateContentGrams": 41.7,
    "proteinContentGrams": 28.9,
    "cholesterolContentMilligrams": 74.8,
    "sodiumContentMilligrams": 1513.8,
    "ingredients": [
      [
        454.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "onion, chopped (unit)"
      ],
      [
        2.0,
        "stalks celery, chopped (unit)"
      ],
      [
        118.25,
        "slivered almonds (mL)"
      ],
      [
        236.5,
        "cooked rice (mL)"
      ],
      [
        1.0,
        "(10.75 ounce) can  condensed cream of chicken soup (unit)"
      ],
      [
        118.25,
        "water (mL)"
      ],
      [
        45.0,
        "soy sauce (mL)"
      ],
      [
        5.0,
        "ounces chow mein noodles (unit)"
      ]
    ]
  },
  {
    "name": "Cardamom Maple Salmon",
    "description": "I am a salmon lover. This is a great recipe for a slightly exotic flavor of Indian inspiration with a maple twist. The flavor is exceptional, delicious, and unique. Orange zest may be added for an extra flavor twist.",
    "recipeInstructions": [
      "Stir salt, paprika, cardamom, coriander, and black pepper together in a bowl. Add oil and maple syrup and stir until evenly combined.",
      "Preheat a non-stick frying pan over medium-high heat, about 350 degrees F (175 degrees C).",
      "Dredge salmon pieces through the maple syrup mixture until evenly coated on all sides.",
      "Cook salmon in the preheated pan until fish flakes easily with a fork, 5 to 7 minutes per side."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 25,
    "energyContentCalories": 345.2,
    "fatContentGrams": 23.8,
    "carbohydrateContentGrams": 5.2,
    "proteinContentGrams": 26.3,
    "cholesterolContentMilligrams": 74.4,
    "sodiumContentMilligrams": 654.4,
    "ingredients": [
      [
        7.5,
        "salt (mL)"
      ],
      [
        5.0,
        "paprika (mL)"
      ],
      [
        5.0,
        "ground cardamom (mL)"
      ],
      [
        5.0,
        "ground coriander (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        59.125,
        "grapeseed oil (mL)"
      ],
      [
        30.0,
        "maple syrup (mL)"
      ],
      [
        1.0,
        "(2 pound) salmon fillet, cut into 3-inch pieces (unit)"
      ]
    ]
  },
  {
    "name": "Corn Dog Muffins",
    "description": "An easy way to make the favorite treat from the fair. You can substitute cocktail wieners for hot dogs.",
    "recipeInstructions": [
      "Preheat oven to 400 degrees F (200 degrees C). Lightly grease muffin tins.",
      "Stir together the cornbread mix and the brown sugar in a large bowl. Whisk the eggs and milk in a small bowl until smooth. Fold the eggs and cheese into the dry mixture until moistened. Spoon mixture into muffin tins until 2/3 full.  Add 1 hot dog half  to each muffin.",
      "Bake in a preheated oven 14 to 18 minutes, or until golden brown."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 14,
    "totalTimeMinutes": 24,
    "energyContentCalories": 245.5,
    "fatContentGrams": 14.0,
    "carbohydrateContentGrams": 21.4,
    "proteinContentGrams": 8.3,
    "cholesterolContentMilligrams": 44.7,
    "sodiumContentMilligrams": 806.4,
    "ingredients": [
      [
        2.0,
        "(8.5 ounce) packages cornbread mix (unit)"
      ],
      [
        30.0,
        "brown sugar (mL)"
      ],
      [
        2.0,
        "egg (unit)"
      ],
      [
        354.75,
        "milk (mL)"
      ],
      [
        236.5,
        "grated cheddar cheese (mL)"
      ],
      [
        9.0,
        "frankfurter, (5 in long x 7/8 in dia, 8 per pound)s hot dogs, cut in half (unit)"
      ]
    ]
  },
  {
    "name": "Tater Tot Taco Casserole",
    "description": "Just what the grandkids ordered. Tater tots, Mexican food, and cheese! This is one of those meals that you can throw together with ingredients you would normally have on hand. Great for pot luck or a quick meal for unexpected company. Some kids don't like onion or garlic; these can be omitted.",
    "recipeInstructions": [
      "Preheat an oven to 375 degrees F (190 degrees C). Prepare a 9x13-inch baking dish with cooking spray.",
      "Cook the ground beef in a skillet over medium heat until completely browned, 5 to 7 minutes. Add the onion, garlic, taco seasoning mix, frozen Mexican-style corn, and black beans to the ground beef; cook and stir another 10 minutes. Set aside to cool slightly.",
      "Combine the ground beef mixture in a large bowl with about 3/4 of the Mexican cheese blend and the tater tots; stir to combine.",
      "Pour about 1/3 of the enchilada sauce into the bottom of the prepared baking dish. Add the tater tot mixture to the baking dish; lightly pat the mixture down into a solid, even layer. Pour the remaining enchilada sauce over the tater tot layer.",
      "Bake in the preheated oven for 40 minutes. Sprinkle the remaining Mexican cheese over the casserole and return to oven until the cheese is melted and bubbly, about 5 minutes more."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 60,
    "totalTimeMinutes": 75,
    "energyContentCalories": 477.3,
    "fatContentGrams": 27.0,
    "carbohydrateContentGrams": 38.4,
    "proteinContentGrams": 24.9,
    "cholesterolContentMilligrams": 75.6,
    "sodiumContentMilligrams": 1305.3,
    "ingredients": [
      [
        454.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "small onion, diced (unit)"
      ],
      [
        1.0,
        "clove garlic, minced (unit)"
      ],
      [
        1.0,
        "(1 ounce) packet taco seasoning mix (unit)"
      ],
      [
        1.0,
        "(16 ounce) bag frozen mexican-style corn (unit)"
      ],
      [
        1.0,
        "(12 ounce) can black beans, rinsed and drained (unit)"
      ],
      [
        1.0,
        "(12 ounce) bag shredded mexican cheese blend (unit)"
      ],
      [
        1.0,
        "(16 ounce) package frozen tater tots (unit)"
      ],
      [
        1.0,
        "(12 fluid ounce) can enchilada sauce (unit)"
      ]
    ]
  },
  {
    "name": "Low-Carb Almond Cinnamon Butter Cookies",
    "description": "My quick and easy go-to keto and gluten-free cookie recipe whenever I want to have something sweet, with very few net carbs per cookie!",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
      "Combine almond flour, butter, egg, sweetener, vanilla extract, and cinnamon in a bowl; mix until well combined.",
      "Roll dough into 1-inch balls. Place on the prepared baking sheet and press down with a fork twice in a criss-cross pattern.",
      "Bake in the the preheated oven until edges are golden, 12 to 15 minutes. Cool on the baking sheet for 1 minute before removing to a wire rack to cool completely."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 12,
    "totalTimeMinutes": 23,
    "energyContentCalories": 196.3,
    "fatContentGrams": 18.4,
    "carbohydrateContentGrams": 12.7,
    "proteinContentGrams": 5.0,
    "cholesterolContentMilligrams": 35.8,
    "sodiumContentMilligrams": 60.4,
    "ingredients": [
      [
        473.0,
        "blanched almond flour (mL)"
      ],
      [
        118.25,
        "butter, softened (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        118.25,
        "low-calorie natural sweetener (such as swerve®) (mL)"
      ],
      [
        5.0,
        "sugar-free vanilla extract (mL)"
      ],
      [
        5.0,
        "ground cinnamon (mL)"
      ]
    ]
  },
  {
    "name": "Breakfast Cheesecake",
    "description": "These cheesecake pastries are a family favorite for breakfast OR dessert! Dust with powdered sugar before serving and store leftovers in the refrigerator.",
    "recipeInstructions": [
      "Preheat the oven to 350 degrees F (175 degrees C).",
      "Press 1 package's worth of crescent rolls, still connected, onto the bottom of a greased 9x12-inch baking dish.",
      "Combine cream cheese, egg yolk, sugar, lemon juice, and vanilla extract in a bowl; beat with an electric mixer until fluffy. Spread mixture on top of the crescent roll \"crust\" in the baking dish.",
      "Cover cream cheese filling with the second package of crescent roll dough and brush with egg white.",
      "Bake in the preheated oven until puffed up and golden, 25 to 35 minutes. Remove from oven and allow to cool."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 50,
    "energyContentCalories": 265.5,
    "fatContentGrams": 17.1,
    "carbohydrateContentGrams": 22.6,
    "proteinContentGrams": 4.8,
    "cholesterolContentMilligrams": 45.3,
    "sodiumContentMilligrams": 327.8,
    "ingredients": [
      [
        2.0,
        "(8 ounce) packages refrigerated crescent rolls (unit)"
      ],
      [
        2.0,
        "(8 ounce) packages cream cheese, softened (unit)"
      ],
      [
        1.0,
        "egg, separated (unit)"
      ],
      [
        177.375,
        "sugar (mL)"
      ],
      [
        5.0,
        "lemon juice (mL)"
      ],
      [
        2.5,
        "vanilla extract (mL)"
      ]
    ]
  },
  {
    "name": "Air Fryer Beignets",
    "description": "These beignets take on a wholesome aspect as they're cooked in an air fryer. You will need a silicone egg-bite mold, available through retailers like Amazon®.",
    "recipeInstructions": [
      "Preheat air fryer to 370 degrees F (185 degrees C). Spray a silicone egg-bite mold with nonstick cooking spray.",
      "Whisk flour, sugar, water, egg yolk, butter, baking powder, vanilla extract, and salt together in a large bowl. Stir to combine.",
      "Beat egg white in a small bowl using an electric hand mixer on medium speed until soft peaks form. Fold into batter. Add batter to the prepared mold using a small hinged ice cream scoop.",
      "Place filled silicone mold into the basket of the air fryer.",
      "Fry in the preheated air fryer for 10 minutes. Remove mold from the basket carefully; pop beignets out and flip over onto a parchment paper round.",
      "Place parchment round with beignets back into the air fryer basket. Cook for an additional 4 minutes. Remove beignets from the air fryer basket and dust with confectioners' sugar."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 25,
    "energyContentCalories": 87.7,
    "fatContentGrams": 1.7,
    "carbohydrateContentGrams": 16.2,
    "proteinContentGrams": 1.8,
    "cholesterolContentMilligrams": 28.9,
    "sodiumContentMilligrams": 73.5,
    "ingredients": [
      [
        1.0,
        "cooking spray (serving)"
      ],
      [
        118.25,
        "all-purpose flour (mL)"
      ],
      [
        59.125,
        "sugar (mL)"
      ],
      [
        29.5625,
        "water (mL)"
      ],
      [
        1.0,
        "large egg, separated (unit)"
      ],
      [
        7.5,
        "melted butter (mL)"
      ],
      [
        2.5,
        "baking powder (mL)"
      ],
      [
        2.5,
        "vanilla extract (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        30.0,
        "powdered sugar (mL)"
      ]
    ]
  },
  {
    "name": "Sheet Pan Apple Crisp",
    "description": "This one's great for feeding a crowd.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C). Grease a rimmed baking sheet.",
      "Place apples wedges in a bowl. Sprinkle brown sugar and 1 teaspoon cinnamon over the apples and toss. Add 1/2 cup flour and mix well. Place apple mixture on the prepared baking sheet.",
      "Place the remaining 1/2 cup flour in another bowl. Cut in butter with 2 knives or a pastry blender until it's the size of small peas. Add the remaining 1 teaspoon cinnamon, oats, walnuts, maple syrup, pumpkin pie spice, vanilla extract, and salt. Spoon mixture over the apples.",
      "Bake in the preheated oven until fruit mixture is bubbling, 45 to 50 minutes."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 45,
    "totalTimeMinutes": 65,
    "energyContentCalories": 340.1,
    "fatContentGrams": 15.3,
    "carbohydrateContentGrams": 50.3,
    "proteinContentGrams": 4.3,
    "cholesterolContentMilligrams": 20.3,
    "sodiumContentMilligrams": 156.6,
    "ingredients": [
      [
        12.0,
        "medium (2-3/4\" dia) (approx 3 per lb)s apples, cored and cut into 8 wedges (unit)"
      ],
      [
        177.375,
        "brown sugar (mL)"
      ],
      [
        10.0,
        "ground cinnamon (mL)"
      ],
      [
        236.5,
        "all-purpose flour (mL)"
      ],
      [
        118.25,
        "cold butter (mL)"
      ],
      [
        354.75,
        "old-fashioned rolled oats (mL)"
      ],
      [
        236.5,
        "chopped walnuts (mL)"
      ],
      [
        78.8255,
        "maple syrup (mL)"
      ],
      [
        5.0,
        "pumpkin pie spice (mL)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ]
    ]
  },
  {
    "name": "Authentic Korean Bulgogi",
    "description": "This is the Korean Bul-Go-Gi recipe I've learned from my mother who lives in Korea. I've made this dish many times and got raves every time. Yummy!",
    "recipeInstructions": [
      "Place the beef in a bowl, and pour in the cooking wine, pear juice, and black pepper. Stir to combine, and allow to marinate for 30 minutes. Stir in the soy sauce, sugar, sesame oil, garlic, green onion, and sesame seeds, and marinate in refrigerator at least 2 hours or overnight.",
      "Preheat an outdoor grill for medium-high heat.",
      "Remove the beef from the marinade, and discard the marinade. Place a sheet of aluminum foil on the heated grill, and lay the beef slices separately on the foil. Place the mushrooms and onion on another part of the foil. Cook the beef slices until they are evenly brown, 3 to 5 minutes per side. Serve with cooked mushrooms and onion."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 180,
    "energyContentCalories": 374.8,
    "fatContentGrams": 18.1,
    "carbohydrateContentGrams": 19.2,
    "proteinContentGrams": 33.3,
    "cholesterolContentMilligrams": 73.6,
    "sodiumContentMilligrams": 1018.3,
    "ingredients": [
      [
        680.0,
        "beef top sirloin, thinly sliced (g)"
      ],
      [
        30.0,
        "white cooking wine (mL)"
      ],
      [
        236.5,
        "pear juice (mL)"
      ],
      [
        5.0,
        "ground black pepper (mL)"
      ],
      [
        59.125,
        "soy sauce (mL)"
      ],
      [
        15.0,
        "sugar (mL)"
      ],
      [
        30.0,
        "asian (toasted) sesame oil (mL)"
      ],
      [
        15.0,
        "minced garlic (mL)"
      ],
      [
        30.0,
        "chopped green onion (mL)"
      ],
      [
        15.0,
        "sesame seeds (mL)"
      ],
      [
        227.0,
        "fresh mushrooms, halved (g)"
      ],
      [
        0.5,
        "onion, chopped (unit)"
      ]
    ]
  },
  {
    "name": "Kongnamool (Korean Soybean Sprouts)",
    "description": "A fresh Korean favorite with the flavor of kim chi. Enjoy with a bowl of rice.",
    "recipeInstructions": [
      "Bring a large pot of lightly salted water to a boil. Add the bean sprouts, and cook uncovered until tender yet still crisp, about 15 seconds. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the bean sprouts are cold, drain well, and set aside.",
      "Whisk soy sauce, sesame oil, chile powder, garlic, and sesame seeds together in a large bowl. Stir in bean sprouts and toss until well coated with the sauce. Sprinkle with green onions and season with rice wine vinegar. Refrigerate before serving."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 15,
    "energyContentCalories": 287.9,
    "fatContentGrams": 22.7,
    "carbohydrateContentGrams": 14.8,
    "proteinContentGrams": 16.3,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 508.3,
    "ingredients": [
      [
        454.0,
        "soybean sprouts (g)"
      ],
      [
        30.0,
        "soy sauce (mL)"
      ],
      [
        59.125,
        "sesame oil (mL)"
      ],
      [
        30.0,
        "korean chile powder (mL)"
      ],
      [
        7.5,
        "garlic, minced (mL)"
      ],
      [
        10.0,
        "sesame seeds (mL)"
      ],
      [
        59.125,
        "chopped green onion (mL)"
      ],
      [
        10.0,
        "rice wine vinegar (mL)"
      ]
    ]
  },
  {
    "name": "Baked Vegetable Rice Pilaf",
    "description": "Three types of veggies and rice mixed together, but it is the cheese that really makes this dish.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "Mix chicken broth, rice, corn, peas, carrot, and onion together in a casserole dish; cover with aluminum foil.",
      "Bake in the preheated oven until rice is tender and broth has been absorbed, about 30 minutes. Remove aluminum foil and sprinkle pilaf with Cheddar cheese; cover with aluminum foil. Continue baking until cheese is melted, about 5 minutes."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 45,
    "energyContentCalories": 209.7,
    "fatContentGrams": 5.2,
    "carbohydrateContentGrams": 32.7,
    "proteinContentGrams": 7.3,
    "cholesterolContentMilligrams": 16.7,
    "sodiumContentMilligrams": 466.0,
    "ingredients": [
      [
        354.75,
        "boiling chicken broth (mL)"
      ],
      [
        177.375,
        "long-grain white rice (mL)"
      ],
      [
        59.125,
        "frozen corn (mL)"
      ],
      [
        59.125,
        "frozen peas (mL)"
      ],
      [
        59.125,
        "chopped carrot (mL)"
      ],
      [
        15.0,
        "minced onion (mL)"
      ],
      [
        118.25,
        "shredded cheddar cheese (mL)"
      ]
    ]
  },
  {
    "name": "Alfredo Sauce",
    "description": "Rich and creamy! I have found that Parmesan cheese doesn't melt well, and often substitute Gruyere cheese.",
    "recipeInstructions": [
      "Melt butter in a medium saucepan over medium low heat. Add cream and simmer for 5 minutes, then add garlic and cheese and whisk quickly, heating through. Stir in parsley and serve."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 20,
    "energyContentCalories": 438.8,
    "fatContentGrams": 42.1,
    "carbohydrateContentGrams": 3.4,
    "proteinContentGrams": 13.0,
    "cholesterolContentMilligrams": 138.4,
    "sodiumContentMilligrams": 565.3,
    "ingredients": [
      [
        59.125,
        "butter (mL)"
      ],
      [
        236.5,
        "heavy cream (mL)"
      ],
      [
        1.0,
        "clove garlic, crushed (unit)"
      ],
      [
        354.75,
        "freshly grated parmesan cheese (mL)"
      ],
      [
        59.125,
        "chopped fresh parsley (mL)"
      ]
    ]
  },
  {
    "name": "Grandma's Butterscotch Pie",
    "description": "This is one of my favorite holiday pies. Serve with whipped cream. Yum!",
    "recipeInstructions": [
      "In top of double boiler, combine brown sugar, cornstarch, salt and milk. Cook, stirring constantly, until mixture starts to thicken, about 20 minutes.",
      "Whisk in egg yolks; continue to cook and stir until filling is thickened.",
      "While pudding mixture is cooking, preheat the oven to 400 degrees F (200 degrees C).",
      "Remove filling from heat, and stir in butter and vanilla.",
      "Pour filling into prepared pie crust. Bake in preheated oven until top begins to brown, about 5 minutes."
    ],
    "prepTimeMinutes": 25,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 60,
    "energyContentCalories": 258.6,
    "fatContentGrams": 8.9,
    "carbohydrateContentGrams": 41.5,
    "proteinContentGrams": 3.4,
    "cholesterolContentMilligrams": 59.9,
    "sodiumContentMilligrams": 292.6,
    "ingredients": [
      [
        236.5,
        "light brown sugar (mL)"
      ],
      [
        60.0,
        "cornstarch (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        473.0,
        "milk (mL)"
      ],
      [
        2.0,
        " large egg yolks egg yolks, beaten (unit)"
      ],
      [
        15.0,
        "butter (mL)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        1.0,
        "(9 inch) pie crust, baked (unit)"
      ]
    ]
  },
  {
    "name": "Chocolate Avocado Pudding",
    "description": "Saw this at the market the other day. The ingredients were simple and it looked delicious! Many substitutes abound (liquid, sweetener, spices). Vary amounts to taste!",
    "recipeInstructions": [
      "Blend avocados, cocoa powder, brown sugar, coconut milk, vanilla extract, and cinnamon in a blender until smooth. Refrigerate pudding until chilled, about 30 minutes."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 40,
    "energyContentCalories": 400.3,
    "fatContentGrams": 26.3,
    "carbohydrateContentGrams": 45.9,
    "proteinContentGrams": 5.4,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 22.6,
    "ingredients": [
      [
        2.0,
        "large avocados - peeled, pitted, and cubed (unit)"
      ],
      [
        118.25,
        "cocoa powder (mL)"
      ],
      [
        118.25,
        "brown sugar (mL)"
      ],
      [
        78.8255,
        "coconut milk (mL)"
      ],
      [
        10.0,
        "vanilla extract (mL)"
      ],
      [
        0.31,
        "ground cinnamon (mL)"
      ]
    ]
  },
  {
    "name": "Salty Lemon Gin and Tonic",
    "description": "Gin and tonics are one of my favorite cocktails, but I often like experimenting with different add-ins instead of the traditional lime wedge. The salt from the preserved lemon really brings out the natural botanical flavors in the gin.",
    "recipeInstructions": [
      "Remove the pulp from the lemon with a sharp knife and discard, saving the peel. Lightly rinse peel with cool water. Slice off a thin sliver of peel and set aside for garnish.",
      "Combine lemon peel and gin in a shaker. Muddle lemon until slightly crushed. Add 1 cup ice to the shaker, cover, and shake until chilled, 15 to 20 seconds.",
      "Fill a rocks glass with ice and strain cocktail over the ice. Top with tonic water. Garnish with lemon sliver and rosemary sprig."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 10,
    "energyContentCalories": 198.4,
    "fatContentGrams": 0.0,
    "carbohydrateContentGrams": 14.3,
    "proteinContentGrams": 0.0,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 3106.4,
    "ingredients": [
      [
        0.25,
        "preserved lemon (unit)"
      ],
      [
        2.0,
        "fluid ounces gin (unit)"
      ],
      [
        473.0,
        "ice cubes (mL)"
      ],
      [
        4.0,
        "fluid ounces tonic water (such as fever tree) (unit)"
      ],
      [
        1.0,
        "small sprig fresh rosemary (unit)"
      ]
    ]
  },
  {
    "name": "Asian Shrimp Rice Bowl",
    "description": "Easy to prepare ahead of time and so much great flavor! Serve this on square, Asian-inspired dinnerware with chopsticks for a gorgeous presentation.",
    "recipeInstructions": [
      "Whisk soy sauce, hoisin sauce, honey, chili paste, and orange marmalade together in a small bowl.  Stir shrimp into the marinade; refrigerate for one hour.",
      "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.",
      "Heat oil in a large skillet or wok. Cook the orange pepper, red pepper, sugar snap peas, and onion in hot oil until they just begin to soften, 2 to 3 minutes. Toss the marinated shrimp, garlic, ginger, and sesame oil into the vegetables; continue to cook until shrimp is heated through, 2 to 3 minutes more.",
      "Serve over hot jasmine rice, sprinkled with sesame seeds."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 25,
    "totalTimeMinutes": 100,
    "energyContentCalories": 654.7,
    "fatContentGrams": 9.5,
    "carbohydrateContentGrams": 118.1,
    "proteinContentGrams": 23.7,
    "cholesterolContentMilligrams": 111.1,
    "sodiumContentMilligrams": 1633.5,
    "ingredients": [
      [
        78.8255,
        "soy sauce (mL)"
      ],
      [
        59.125,
        "hoisin sauce (mL)"
      ],
      [
        30.0,
        "honey (mL)"
      ],
      [
        15.0,
        "chile paste (mL)"
      ],
      [
        30.0,
        "orange marmalade (mL)"
      ],
      [
        227.0,
        "cooked shrimp (g)"
      ],
      [
        473.0,
        "uncooked jasmine rice (mL)"
      ],
      [
        709.5,
        "water (mL)"
      ],
      [
        30.0,
        "olive oil (mL)"
      ],
      [
        1.0,
        "orange bell pepper, cut into 1/2-inch dice (unit)"
      ],
      [
        1.0,
        "red bell pepper, cut into 1/2-inch dice (unit)"
      ],
      [
        473.0,
        "sugar snap peas (mL)"
      ],
      [
        1.0,
        "sweet onion, cut into 1/2-inch dice (unit)"
      ],
      [
        4.0,
        "cloves garlic, minced (unit)"
      ],
      [
        10.0,
        "minced fresh ginger root (mL)"
      ],
      [
        1.25,
        "sesame oil (mL)"
      ],
      [
        7.5,
        "sesame seeds (mL)"
      ]
    ]
  },
  {
    "name": "Carrot Pulp Muffins",
    "description": "Looking at the mound of carrot pulp from my juicer and then at my 2-1/2-year-old daughter (who loves bread) inspired me to experiment... This muffin is dense, healthy, and can be tweaked to suit your tastes. As is, it is not sweet, but you could certainly add mashed ripe banana or pineapple. Once out of the oven, sprinkle the tops with cinnamon sugar while they are still hot.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin with cooking spray.",
      "Mix carrot pulp, applesauce, eggs, and brown sugar together in a bowl.",
      "Mix spelt flour, oats, cinnamon, baking soda, baking powder, nutmeg, and ginger together in a separate bowl.",
      "Combine carrot pulp and flour mixtures until batter is blended and thick. Fold in walnuts and raisins.",
      "Spoon batter into the prepared muffin tin. Press down and fill each cup to the top.",
      "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 25,
    "totalTimeMinutes": 45,
    "energyContentCalories": 117.0,
    "fatContentGrams": 4.4,
    "carbohydrateContentGrams": 17.4,
    "proteinContentGrams": 3.6,
    "cholesterolContentMilligrams": 31.0,
    "sodiumContentMilligrams": 95.8,
    "ingredients": [
      [
        1.0,
        "cooking spray (serving)"
      ],
      [
        354.75,
        "carrot pulp (mL)"
      ],
      [
        118.25,
        "applesauce (mL)"
      ],
      [
        2.0,
        "egg (unit)"
      ],
      [
        30.0,
        "brown sugar (mL)"
      ],
      [
        236.5,
        "spelt flour (mL)"
      ],
      [
        59.125,
        "rolled oats (mL)"
      ],
      [
        5.0,
        "ground cinnamon (mL)"
      ],
      [
        2.5,
        "baking soda (mL)"
      ],
      [
        2.5,
        "baking powder (mL)"
      ],
      [
        1.25,
        "ground nutmeg (mL)"
      ],
      [
        0.625,
        "ground ginger (mL)"
      ],
      [
        118.25,
        "chopped walnuts (mL)"
      ],
      [
        78.8255,
        "raisins (mL)"
      ]
    ]
  },
  {
    "name": "Whole Wheat Blueberry Muffins",
    "description": "These yummy muffins are made with all whole wheat flour and lots of fresh blueberries.  My husband says they're the best muffins he's ever tasted, and even my super picky kids love them!",
    "recipeInstructions": [
      "Preheat oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line with paper liners. Whisk together the flour, sugar, salt, and baking powder in a large bowl.",
      "Whisk vegetable oil, egg, milk, and applesauce together in a separate bowl until smooth, and stir the liquid ingredients into the flour mixture until moistened. Lightly stir in the blueberries. Spoon the batter into the prepared muffin cups, filling them 2/3 full.",
      "Bake muffins in the preheated oven until they rise and the tops are golden brown, about 20 minutes. A toothpick inserted into the center of a muffin should come out clean."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 35,
    "energyContentCalories": 183.0,
    "fatContentGrams": 7.0,
    "carbohydrateContentGrams": 29.1,
    "proteinContentGrams": 3.0,
    "cholesterolContentMilligrams": 16.0,
    "sodiumContentMilligrams": 188.0,
    "ingredients": [
      [
        354.75,
        "whole wheat flour (mL)"
      ],
      [
        177.375,
        "sugar (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        10.0,
        "baking powder (mL)"
      ],
      [
        78.8255,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        78.8255,
        "milk (mL)"
      ],
      [
        118.25,
        "unsweetened applesauce (mL)"
      ],
      [
        1.0,
        "pint fresh blueberries (unit)"
      ]
    ]
  },
  {
    "name": "Tempura Dipping Sauce",
    "description": "The traditional Japanese dipping sauce for shrimp or vegetable tempura. This is the full-flavored version - unlike the thinner, watery, less robust sauce being served in some restaurants. Serve in small bowls at each setting. Optionally, provide grated fresh ginger and grated daikon to mix into sauce.",
    "recipeInstructions": [
      "In a small saucepan, bring water to a boil. Stir in dashi, and cook for 2 minutes. Remove from heat, and stir in mirin and soy sauce."
    ],
    "prepTimeMinutes": 0,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 5,
    "energyContentCalories": 37.9,
    "fatContentGrams": 0.0,
    "carbohydrateContentGrams": 5.3,
    "proteinContentGrams": 0.6,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 452.8,
    "ingredients": [
      [
        236.5,
        "water (mL)"
      ],
      [
        15.0,
        "dashi granules (mL)"
      ],
      [
        59.125,
        "mirin (japanese sweet wine) (mL)"
      ],
      [
        30.0,
        "soy sauce (mL)"
      ]
    ]
  },
  {
    "name": "Eggplant Parmesan II",
    "description": "This is a no fry variation of this popular dish, and is just as delicious!",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "Dip eggplant slices in egg, then in bread crumbs.  Place in a single layer on a baking sheet.  Bake in preheated oven for 5 minutes on each side.",
      "In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom.  Place a layer of eggplant slices in the sauce.  Sprinkle with mozzarella and Parmesan cheeses.  Repeat with remaining ingredients, ending with the cheeses.  Sprinkle basil on top.",
      "Bake in preheated oven for 35 minutes, or until golden brown."
    ],
    "prepTimeMinutes": 25,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 60,
    "energyContentCalories": 487.4,
    "fatContentGrams": 16.0,
    "carbohydrateContentGrams": 62.1,
    "proteinContentGrams": 24.2,
    "cholesterolContentMilligrams": 72.8,
    "sodiumContentMilligrams": 1663.1,
    "ingredients": [
      [
        3.0,
        "eggplant, peeled (yield from 1.25 lb)s eggplant, peeled and thinly sliced (unit)"
      ],
      [
        2.0,
        "eggs, beaten (unit)"
      ],
      [
        946.0,
        "italian seasoned bread crumbs (mL)"
      ],
      [
        1419.0,
        "spaghetti sauce (mL)"
      ],
      [
        1.0,
        "(16 ounce) package mozzarella cheese, shredded (unit)"
      ],
      [
        118.25,
        "grated parmesan cheese (mL)"
      ],
      [
        2.5,
        "dried basil (mL)"
      ]
    ]
  },
  {
    "name": "Frozen Pork Chops in the Instant Pot®",
    "description": "When the main component of dinner is frozen solid, it's often easier to order carry-out, but this recipe takes advantage of frozen pork chops. I buy my seasonings from the Savory Spice® Shop, although feel free to use what you have on hand.",
    "recipeInstructions": [
      "Turn on a multi-functional pressure cooker (such as Instant Pot&reg;) and select Saute function. Add butter once the pot is hot. Add onion and stir frequently until soft and fragrant, about 5 minutes. Add garlic base and pour in water. Stir to combine.",
      "Mix all-purpose seasoning and shallot salt together in a bowl and sprinkle on both sides of the pork chops. Nestle pork chops on top of the onion. Hit Cancel. Seal and lock the lid into place.",
      "Select high pressure according to manufacturer's instructions; set timer for 13 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Release pressure using the natural-release method according to manufacturer's instructions for 12 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid.",
      "Remove pork chops to a plate. Hit Cancel and switch to Saute function. Add mushrooms and stir.",
      "Whisk whipping cream, flour, and browning sauce together in a measuring cup. Add mixture to the Instant Pot&reg;. Allow to thicken slightly, about 3 minutes. Ladle mushroom gravy on top of pork chops. Serve immediately."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 70,
    "energyContentCalories": 265.9,
    "fatContentGrams": 16.8,
    "carbohydrateContentGrams": 10.6,
    "proteinContentGrams": 18.4,
    "cholesterolContentMilligrams": 76.6,
    "sodiumContentMilligrams": 804.9,
    "ingredients": [
      [
        30.0,
        "butter (mL)"
      ],
      [
        1.0,
        "yellow onion, thinly sliced (unit)"
      ],
      [
        5.0,
        "garlic base (such as better than bouillon® roasted garlic base) (mL)"
      ],
      [
        118.25,
        "water (mL)"
      ],
      [
        10.0,
        "all-purpose seasoning (such as savory spice® wash park seasoning) (mL)"
      ],
      [
        7.5,
        "shallot salt (such as savory spice® supreme shallot salt) (mL)"
      ],
      [
        567.0,
        "bone-in, thick-cut, frozen pork chops (g)"
      ],
      [
        6.0,
        "ounces portobello mushrooms, quartered (unit)"
      ],
      [
        59.125,
        "whipping cream (mL)"
      ],
      [
        15.0,
        "all-purpose flour (mL)"
      ],
      [
        2.5,
        "browning sauce (mL)"
      ]
    ]
  },
  {
    "name": "Lemon Chicken and Snow Pea Noodle Bowls",
    "description": "Delicious, healthy Asian recipe. Very versatile. My family loves it! This recipe can also have broccoli, baby corn, tofu or be served over chow mein noodles.",
    "recipeInstructions": [
      "Bring a large pot of water to a boil. Add chicken; cook until an internal thermometer inserted into the center reads at least 165 degrees F (74 degrees C), 15 to 20 minutes. Drain and cool until easily handled; cut into cubes.",
      "Mix chicken with coriander in a bowl.",
      "Bring a large pot of lightly salted water to a boil. Cook angel hair, stirring occasionally, until tender yet firm to the bite, 4 to 5 minutes. Drain.",
      "Heat olive oil in a large skillet over medium-high heat. Add half the chicken; cover and cook until lightly browned, about 1 minute. Transfer to a plate. Repeat with remaining chicken.",
      "Combine 1 1/2 cup broth and snow peas in the same skillet; cover and cook until just tender, 3 to 4 minutes. Return chicken to the skillet. Stir in remaining 1/2 cup broth and lemon juice; cover and simmer until flavors combine, 3 to 5 minutes. Season with salt and pepper.",
      "Serve chicken over pasta. Garnish with chopped scallions."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 37,
    "totalTimeMinutes": 47,
    "energyContentCalories": 590.9,
    "fatContentGrams": 13.8,
    "carbohydrateContentGrams": 68.1,
    "proteinContentGrams": 47.3,
    "cholesterolContentMilligrams": 90.3,
    "sodiumContentMilligrams": 825.2,
    "ingredients": [
      [
        680.0,
        "boneless chicken breast (g)"
      ],
      [
        10.0,
        "ground coriander (mL)"
      ],
      [
        1.0,
        "(16 ounce) package angel hair pasta (unit)"
      ],
      [
        30.0,
        "extra-virgin olive oil (mL)"
      ],
      [
        473.0,
        "chicken broth (mL)"
      ],
      [
        473.0,
        "snow peas, trimmed (mL)"
      ],
      [
        15.0,
        "lemon juice (mL)"
      ],
      [
        0.31,
        "salt and ground black pepper (mL)"
      ],
      [
        118.25,
        "chopped scallions (mL)"
      ]
    ]
  },
  {
    "name": "Fig and Arugula Salad",
    "description": "So simple and so delicious!",
    "recipeInstructions": [
      "Toss arugula, figs, Parmesan cheese, and pine nuts together in a large bowl.",
      "Drizzle honey and balsamic vinegar over salad before serving."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 15,
    "energyContentCalories": 161.7,
    "fatContentGrams": 4.1,
    "carbohydrateContentGrams": 30.5,
    "proteinContentGrams": 4.3,
    "cholesterolContentMilligrams": 4.4,
    "sodiumContentMilligrams": 85.4,
    "ingredients": [
      [
        946.0,
        "arugula (mL)"
      ],
      [
        8.0,
        "medium (2-1/4\" dia)s fresh figs, quartered (unit)"
      ],
      [
        59.125,
        "grated parmesan cheese (mL)"
      ],
      [
        30.0,
        "toasted pine nuts (mL)"
      ],
      [
        30.0,
        "honey (mL)"
      ],
      [
        30.0,
        "balsamic vinegar (mL)"
      ]
    ]
  },
  {
    "name": "Easy Baked Cheese and Vegetable Twist",
    "description": "This new take on broccoli casserole boasts cream cheese, veggies and a delicate crescent roll crust.",
    "recipeInstructions": [
      "Heat oven to 375 degrees F.",
      "Mix first 3 ingredients in large bowl until well blended. Stir in next 4 ingredients.",
      "Unroll dough; separate into 16 triangles. Arrange in 11-inch circle on foil-covered baking sheet, with short sides of triangles overlapping in center and points of triangles toward outside. (There should be a 5-inch diameter opening in center of circle.) Spoon cheese mixture onto dough near center of circle. Bring outside points of triangles up over filling, then tuck under dough in center of ring to cover filling.",
      "Bake 35 to 40 min. or until crust is golden brown and filling is heated through."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 60,
    "energyContentCalories": 169.8,
    "fatContentGrams": 10.0,
    "carbohydrateContentGrams": 13.7,
    "proteinContentGrams": 6.0,
    "cholesterolContentMilligrams": 35.0,
    "sodiumContentMilligrams": 315.7,
    "ingredients": [
      [
        2.0,
        "egg (unit)"
      ],
      [
        4.0,
        "ounces philadelphia cream cheese, softened (unit)"
      ],
      [
        118.25,
        "kraft 2% milk shredded italian* three cheese blend (mL)"
      ],
      [
        709.5,
        "frozen broccoli cuts, thawed, drained (mL)"
      ],
      [
        118.25,
        "fresh mushrooms, cut into quarters (mL)"
      ],
      [
        118.25,
        "cherry tomatoes, cut in half (mL)"
      ],
      [
        4.0,
        "medium (4-1/8\" long)s green onions, sliced (unit)"
      ],
      [
        2.0,
        "(8 ounce) cans refrigerated crescent dinner rolls  (unit)"
      ]
    ]
  },
  {
    "name": "Apple Crisp II",
    "description": "A simple dessert that's great served with ice cream.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degree C).",
      "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.",
      "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.",
      "Bake at 350 degrees F (175 degrees C) for about 45 minutes."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 45,
    "totalTimeMinutes": 80,
    "energyContentCalories": 316.0,
    "fatContentGrams": 8.4,
    "carbohydrateContentGrams": 60.5,
    "proteinContentGrams": 2.4,
    "cholesterolContentMilligrams": 20.3,
    "sodiumContentMilligrams": 97.9,
    "ingredients": [
      [
        2365.0,
        "all-purpose apples, peeled, cored and sliced (mL)"
      ],
      [
        236.5,
        "sugar (mL)"
      ],
      [
        15.0,
        "all-purpose flour (mL)"
      ],
      [
        5.0,
        "ground cinnamon (mL)"
      ],
      [
        118.25,
        "water (mL)"
      ],
      [
        236.5,
        "quick-cooking oats (mL)"
      ],
      [
        236.5,
        "all-purpose flour (mL)"
      ],
      [
        236.5,
        "brown sugar (mL)"
      ],
      [
        1.25,
        "baking powder (mL)"
      ],
      [
        1.25,
        "baking soda (mL)"
      ],
      [
        118.25,
        "butter, melted (mL)"
      ]
    ]
  },
  {
    "name": "Authentic Bangladeshi Beef Curry",
    "description": "This spicy beef curry is best served with plain basmati rice or eaten with naan or pita bread.",
    "recipeInstructions": [
      "Heat olive oil in a skillet over medium heat. Add onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.",
      "Stir in the garlic, green chiles, ginger paste, cardamom seeds, cloves, and cinnamon sticks. Cook and stir until the garlic begins to brown, 3 to 5 more minutes.",
      "Mix cumin, coriander, turmeric, garlic powder, cayenne pepper, and water into the onion mixture. Simmer until most of the water has evaporated and the mixture has thickened.",
      "Stir in beef chuck pieces until coated with spice mixture; simmer over medium-low heat, stirring occasionally, until the beef is cooked through and tender, about 1 to 1 1/2 hours."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 105,
    "totalTimeMinutes": 135,
    "energyContentCalories": 319.6,
    "fatContentGrams": 23.1,
    "carbohydrateContentGrams": 8.8,
    "proteinContentGrams": 19.5,
    "cholesterolContentMilligrams": 68.6,
    "sodiumContentMilligrams": 50.4,
    "ingredients": [
      [
        45.0,
        "olive oil (mL)"
      ],
      [
        1.0,
        "onion, chopped (unit)"
      ],
      [
        6.0,
        "cloves garlic, minced (unit)"
      ],
      [
        5.0,
        "eaches green chile peppers, finely sliced (unit)"
      ],
      [
        5.0,
        "ginger paste (mL)"
      ],
      [
        3.0,
        "seeds whole cardamom seeds (unit)"
      ],
      [
        2.0,
        "eaches whole cloves (unit)"
      ],
      [
        1.5,
        "(2 inch) cinnamon sticks (unit)"
      ],
      [
        5.0,
        "ground cumin (mL)"
      ],
      [
        5.0,
        "ground coriander (mL)"
      ],
      [
        5.0,
        "ground turmeric (mL)"
      ],
      [
        5.0,
        "garlic powder (mL)"
      ],
      [
        5.0,
        "cayenne pepper (mL)"
      ],
      [
        236.5,
        "water (mL)"
      ],
      [
        907.0,
        "boneless beef chuck, cut into 1-1/2-inch pieces (g)"
      ]
    ]
  },
  {
    "name": "Best Bread Pudding with Vanilla Sauce",
    "description": "We found this recipe tucked inside my mom's Bible when going through her things. It has become a family tradition on the first snow day of the year and if that doesn't happen, which can be the case here in central Virginia, we know it'll be the featured dessert at Easter and anytime a comfort food is in order.",
    "recipeInstructions": [
      "Preheat  oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish.",
      "In a mixing bowl, whisk 3 eggs, white sugar, 2 tablespoons of light brown sugar, 1/2 teaspoon of cinnamon, 1/4 cup of butter, and 3 cups of whole milk together, and gently stir in the bread cubes and raisins. Lightly spoon the mixture into the prepared baking dish.",
      "Bake in the preheated oven until browned and set in the middle, 50 to 55 minutes; cover the dish with foil after 30 minutes to prevent excessive browning. Let the pudding stand for 10 minutes before serving.",
      "For vanilla sauce, whisk 1/2 cup of light brown sugar, the flour, a pinch of cinnamon, 1 egg, 2 tablespoons of melted butter, 1 1/4 cups of whole milk,and salt together in a heavy saucepan until smooth. Heat over medium heat, whisking constantly, until thickened and the sauce coats the back of a spoon, 10 to 12 minutes. Stir in the vanilla extract. Pour sauce over warm bread pudding, or serve on the side in a bowl."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 60,
    "totalTimeMinutes": 85,
    "energyContentCalories": 546.3,
    "fatContentGrams": 16.5,
    "carbohydrateContentGrams": 91.7,
    "proteinContentGrams": 10.5,
    "cholesterolContentMilligrams": 128.8,
    "sodiumContentMilligrams": 387.3,
    "ingredients": [
      [
        3.0,
        "eggs, beaten (unit)"
      ],
      [
        354.75,
        "sugar (mL)"
      ],
      [
        30.0,
        "light brown sugar (mL)"
      ],
      [
        2.5,
        "ground cinnamon (mL)"
      ],
      [
        59.125,
        "butter, melted (mL)"
      ],
      [
        709.5,
        "whole milk (mL)"
      ],
      [
        10.0,
        "slices hearty farmhouse-style bread, toasted and cut into cubes (unit)"
      ],
      [
        236.5,
        "raisins (mL)"
      ],
      [
        118.25,
        "light brown sugar (mL)"
      ],
      [
        15.0,
        "all-purpose flour (mL)"
      ],
      [
        0.31,
        "ground cinnamon (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        30.0,
        "butter, melted (mL)"
      ],
      [
        295.625,
        "whole milk (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        15.0,
        "vanilla extract (mL)"
      ]
    ]
  },
  {
    "name": "Tuna and Vegetable Casserole",
    "description": "In an attempt to eat healthier, my husband and I have been eating more vegetables and less meats. As a result, I have become more creative coming up with dinner meals. This casserole was delicious, used fresh vegetables I had on hand, and went together very quickly. I topped the casserole with French fried onions. Another option would be more grated cheese or crushed potato chips.",
    "recipeInstructions": [
      "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.",
      "Preheat oven to 425 degrees F (220 degrees C).",
      "Combine green beans, squash, peas, and carrots in a microwave-safe glass or ceramic bowl; cook until tender, 3 to 10 minutes. Rinse vegetables with cold water and drain.",
      "Heat olive oil in a skillet over medium-high heat; saute mushrooms in hot oil until tender, 5 to 7 minutes.",
      "Whisk mushroom soup and milk together in a large bowl; add vegetables, mushrooms, tuna, onion, and Cheddar cheese. Mix in Worcestershire sauce, salt, and black pepper. Pour mixture into a casserole dish and top with French fried onions.",
      "Bake in the preheated oven until bubbling, about 20 minutes."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 50,
    "energyContentCalories": 397.5,
    "fatContentGrams": 20.7,
    "carbohydrateContentGrams": 37.8,
    "proteinContentGrams": 13.9,
    "cholesterolContentMilligrams": 33.2,
    "sodiumContentMilligrams": 625.6,
    "ingredients": [
      [
        0.5,
        "(12 ounce) package egg noodles (unit)"
      ],
      [
        236.5,
        "1-inch pieces fresh-cut green beans (mL)"
      ],
      [
        236.5,
        "bite-size summer squash pieces (mL)"
      ],
      [
        236.5,
        "frozen peas (mL)"
      ],
      [
        236.5,
        "sliced carrots (mL)"
      ],
      [
        5.0,
        "olive oil (mL)"
      ],
      [
        236.5,
        "sliced fresh mushrooms (mL)"
      ],
      [
        1.0,
        "(10.75 ounce) can  condensed cream of mushroom soup (unit)"
      ],
      [
        78.8255,
        "2% milk  (mL)"
      ],
      [
        1.0,
        "(7 ounce) can albacore tuna, drained and broken into chunks (unit)"
      ],
      [
        0.5,
        "onion, chopped (unit)"
      ],
      [
        118.25,
        "shredded cheddar cheese (mL)"
      ],
      [
        15.0,
        "worcestershire sauce (mL)"
      ],
      [
        0.31,
        "salt and ground black pepper (mL)"
      ],
      [
        236.5,
        "french-fried onions (such as french's®) (mL)"
      ]
    ]
  },
  {
    "name": "Chef John's Shakshuka",
    "description": "This North African one-dish-meal is so fast, easy, and delicious. Be sure to cook your sauce until the veggies are nice and soft and sweet. Once the eggs go in, you can finish covered on the stove, or just pop the pan into a hot oven until they cook to your liking.",
    "recipeInstructions": [
      "Heat olive oil in a large, heavy skillet over medium-high heat. Add onions and mushrooms. Sprinkle with salt. Cook and stir until mushrooms release all of their liquid and start to brown, about 10 minutes. Stir in bell peppers and jalapeno pepper. Cook and stir until peppers begin to soften up, about 5 minutes. Season with cumin, paprika, turmeric, black pepper, and cayenne. Stir and cook to \"wake up\" the flavors, about 1 minute. Pour in crushed tomatoes and water. Adjust heat to medium and simmer uncovered until veggies are softened and sweet, stirring occasionally, 15 to 20 minutes. Add more water if sauce becomes too thick.",
      "Make a depression in the sauce for each egg with a large spoon. Crack egg into a small ramekin and slide gently into each indentation; repeat with the rest of the eggs. Season with salt and pepper. Cover and cook until eggs are to your desired doneness.",
      "Top with feta cheese and parsley."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 45,
    "energyContentCalories": 185.2,
    "fatContentGrams": 10.8,
    "carbohydrateContentGrams": 14.9,
    "proteinContentGrams": 9.9,
    "cholesterolContentMilligrams": 188.8,
    "sodiumContentMilligrams": 669.8,
    "ingredients": [
      [
        30.0,
        "olive oil (mL)"
      ],
      [
        1.0,
        "large onion, diced (unit)"
      ],
      [
        118.25,
        "sliced fresh mushrooms (mL)"
      ],
      [
        5.0,
        "salt  (mL)"
      ],
      [
        236.5,
        "diced red bell pepper (mL)"
      ],
      [
        1.0,
        "jalapeno pepper, seeded and sliced (unit)"
      ],
      [
        5.0,
        "cumin (mL)"
      ],
      [
        2.5,
        "paprika (mL)"
      ],
      [
        2.5,
        "ground turmeric (mL)"
      ],
      [
        2.5,
        "freshly ground black pepper, plus more  (mL)"
      ],
      [
        1.25,
        "cayenne pepper (mL)"
      ],
      [
        1.0,
        "(28 ounce) can crushed san marzano tomatoes, or other high-quality plum tomatoes (unit)"
      ],
      [
        118.25,
        "water (mL)"
      ],
      [
        6.0,
        " large eggs large eggs (unit)"
      ],
      [
        30.0,
        "crumbled feta cheese (mL)"
      ],
      [
        30.0,
        "chopped fresh parsley (mL)"
      ]
    ]
  },
  {
    "name": "Super-Delicious Zuppa Toscana",
    "description": "This is an oh-so-good recipe. Just the right amount of spice to make you take a cold drink but definitely keep coming back for more! This soup is irresistible!",
    "recipeInstructions": [
      "Cook the Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside.",
      "Cook the bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in the onions and garlic; cook until onions are soft and translucent, about 5 minutes.",
      "Pour the chicken broth into the Dutch oven with the bacon and onion mixture; bring to a boil over high heat. Add the potatoes, and boil until fork tender, about 20 minutes. Reduce the heat to medium and stir in the heavy cream and the cooked sausage; heat through. Mix the spinach into the soup just before serving."
    ],
    "prepTimeMinutes": 25,
    "cookTimeMinutes": 60,
    "totalTimeMinutes": 85,
    "energyContentCalories": 554.0,
    "fatContentGrams": 32.6,
    "carbohydrateContentGrams": 45.8,
    "proteinContentGrams": 19.8,
    "cholesterolContentMilligrams": 98.9,
    "sodiumContentMilligrams": 2386.4,
    "ingredients": [
      [
        454.0,
        "bulk mild italian sausage (g)"
      ],
      [
        6.25,
        "crushed red pepper flakes (mL)"
      ],
      [
        4.0,
        "slices bacon, cut into 1/2 inch pieces (unit)"
      ],
      [
        1.0,
        "large onion, diced (unit)"
      ],
      [
        15.0,
        "minced garlic (mL)"
      ],
      [
        5.0,
        "(13.75 ounce) cans chicken broth (unit)"
      ],
      [
        6.0,
        "medium (2-1/4\" to 3\" dia, raw)s potatoes, thinly sliced  (unit)"
      ],
      [
        236.5,
        "heavy cream (mL)"
      ],
      [
        0.25,
        "bunch fresh spinach, tough stems removed (unit)"
      ]
    ]
  },
  {
    "name": "Grilled Asian Chicken",
    "description": "Great for last-minute company or a quick dinner by rounding it out with a baked potato and tossed salad.",
    "recipeInstructions": [
      "In a small microwave-safe bowl, combine the soy sauce, oil, honey, ginger root, and garlic. Heat in microwave on medium for 1 minute, then stir. Heat again for 30 seconds, watching closely to prevent boiling.",
      "Place chicken breasts in a shallow dish. Pour soy sauce mixture over, and set aside to marinate for 15 minutes.",
      "Preheat a grill for medium-high heat. Drain marinade from chicken into a small saucepan. Bring to a boil, and simmer over medium heat for 5 minutes. Set aside for basting.",
      "Lightly oil the grill grate. Cook chicken on the prepared grill 6 to 8 minutes per side, or until juices run clear. Baste frequently with remaining marinade. Chicken will turn a beautiful golden brown."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 50,
    "energyContentCalories": 216.6,
    "fatContentGrams": 7.6,
    "carbohydrateContentGrams": 10.6,
    "proteinContentGrams": 25.7,
    "cholesterolContentMilligrams": 67.2,
    "sodiumContentMilligrams": 961.3,
    "ingredients": [
      [
        59.125,
        "soy sauce (mL)"
      ],
      [
        20.0,
        "sesame oil (mL)"
      ],
      [
        30.0,
        "honey (mL)"
      ],
      [
        3.0,
        "slices fresh ginger root (unit)"
      ],
      [
        2.0,
        "cloves garlic, crushed (unit)"
      ],
      [
        4.0,
        " breast half, bone and skin removed (blank)s skinless, boneless chicken breast halves (unit)"
      ]
    ]
  },
  {
    "name": "Rich and Simple French Onion Soup",
    "description": "We have been trying French onion soup in restaurants for years and my family and friends agree none can compare to my recipe for taste and simplicity of preparation.",
    "recipeInstructions": [
      "Melt butter with olive oil in an 8 quart stock pot on medium heat. Add onions and continually stir until tender and translucent. Do not brown the onions.",
      "Add beef broth, sherry and thyme. Season with salt and pepper, and simmer for 30 minutes.",
      "Heat the oven broiler.",
      "Ladle soup into oven safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. Place bowls on cookie sheet and broil in the preheated oven until cheese bubbles and  browns slightly."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 50,
    "totalTimeMinutes": 65,
    "energyContentCalories": 585.3,
    "fatContentGrams": 43.9,
    "carbohydrateContentGrams": 27.9,
    "proteinContentGrams": 20.9,
    "cholesterolContentMilligrams": 98.0,
    "sodiumContentMilligrams": 1578.3,
    "ingredients": [
      [
        118.25,
        "unsalted butter (mL)"
      ],
      [
        30.0,
        "olive oil (mL)"
      ],
      [
        946.0,
        "sliced onions (mL)"
      ],
      [
        4.0,
        "(10.5 ounce) cans beef broth (unit)"
      ],
      [
        30.0,
        "dry sherry (mL)"
      ],
      [
        5.0,
        "dried thyme (mL)"
      ],
      [
        0.31,
        "salt and pepper (mL)"
      ],
      [
        4.0,
        "slices french bread (unit)"
      ],
      [
        4.0,
        "slices provolone cheese (unit)"
      ],
      [
        2.0,
        "slices swiss cheese, diced (unit)"
      ],
      [
        59.125,
        "grated parmesan cheese (mL)"
      ]
    ]
  },
  {
    "name": "Orange-Chicken Rice Bowl",
    "description": "Very delicious. I always make a little extra of the orange juice and Asian toasted sesame dressing on the side, just in case anyone wants extra. Serve over rice. I also like to make brown rice instead of white rice.",
    "recipeInstructions": [
      "Heat a large skillet over medium heat, and place 2 tablespoons of sesame salad dressing in the skillet. Add the chicken, and cook and stir until no longer pink in the middle and beginning to brown, 5 to 7 minutes. Stir in the orange juice and 2 more tablespoons of sesame dressing, and bring to a boil.",
      "Stir in the red bell pepper, zucchini, broccoli, and green onions, and cook and stir until the vegetables are tender and the broccoli is bright green in color, 5 to 8 minutes."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 30,
    "energyContentCalories": 241.5,
    "fatContentGrams": 11.0,
    "carbohydrateContentGrams": 10.1,
    "proteinContentGrams": 26.0,
    "cholesterolContentMilligrams": 64.6,
    "sodiumContentMilligrams": 256.5,
    "ingredients": [
      [
        30.0,
        "asian-style toasted sesame salad dressing (mL)"
      ],
      [
        454.0,
        "skinless, boneless chicken breast halves - cut into 1 1/2 inch pieces (g)"
      ],
      [
        59.125,
        "orange juice (mL)"
      ],
      [
        30.0,
        "asian-style toasted sesame salad dressing (mL)"
      ],
      [
        1.0,
        "red bell pepper, cut into 1 inch chunks (unit)"
      ],
      [
        1.0,
        "zucchini, cut into 1 inch chunks (unit)"
      ],
      [
        473.0,
        "broccoli florets (mL)"
      ],
      [
        2.0,
        "eaches green onions, cut into 1/2-inch pieces (unit)"
      ]
    ]
  },
  {
    "name": "Chef John's Chicken Kiev",
    "description": "I'm not going to say this chicken Kiev is 'easy to make.' It's really not. So, why try? Because, if and when you pull this off, you'll be enjoying one of the greatest chicken experiences of your life. It's also one of the greatest garlic experiences of your life, as well as one of the greatest butter experiences of your life.",
    "recipeInstructions": [
      "Grind garlic and a pinch of salt together in a mortar and pestle until garlic is completely smashed. Add parsley and mix until completely incorporated. Pound butter into garlic mixture with pestle until parsley and garlic are fully incorporated into the butter. Wrap the butter mixture in plastic wrap and refrigerate until cold, at least 15 minutes.",
      "Season chicken breasts with salt and pepper. Place 1/4 the butter mixture in the center of wider end of each chicken breast. Fold the narrower end of each chicken breast up over the butter to form a tight pocket around the butter. Gather the sides of each chicken breast to the center to form a round ball. The top of the chicken will be smooth and the bottom will be gathered. Tightly wrap each chicken breast ball in plastic wrap, put wrapped breasts on a plate, and chill in the freezer until the gathered bottoms hold together and are slightly firm, about 30 minutes.",
      "Whisk flour and 2 teaspoons salt together in a shallow bowl. Whisk eggs together in another shallow bowl. Pour panko bread crumbs into another bowl.",
      "Remove chicken breast balls from plastic wrap. Gently press each chicken breast ball into flour mixture to coat and shake off any excess flour. Dip into beaten eggs, then press into bread crumbs. Place breaded chicken onto a plate, cover with plastic wrap, and return to the freezer to chill until firm, about 15 minutes.",
      "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.",
      "Working in batches, cook chicken, gathered-side down, in hot oil and until lightly golden on both sides, about 1 minute per side. Transfer to prepared baking sheet. Sprinkle salt and cayenne pepper over the top.",
      "Bake in the preheated oven until you can hear the butter start to sizzle on the baking sheet, 15 to 17 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let rest for 5 minutes before serving."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 95,
    "energyContentCalories": 790.3,
    "fatContentGrams": 38.3,
    "carbohydrateContentGrams": 62.2,
    "proteinContentGrams": 59.5,
    "cholesterolContentMilligrams": 268.0,
    "sodiumContentMilligrams": 1656.0,
    "ingredients": [
      [
        2.0,
        "cloves garlic, minced (unit)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        30.0,
        "chopped fresh flat-leaf parsley (mL)"
      ],
      [
        90.0,
        "unsalted butter (mL)"
      ],
      [
        4.0,
        "(8 ounce) skinless, boneless chicken breast halves, pounded to 1/4-inch thickness (unit)"
      ],
      [
        0.31,
        "salt and pepper (mL)"
      ],
      [
        236.5,
        "all-purpose flour (mL)"
      ],
      [
        10.0,
        "salt (mL)"
      ],
      [
        2.0,
        "eggs, beaten (unit)"
      ],
      [
        473.0,
        "panko bread crumbs (mL)"
      ],
      [
        0.31,
        "cayenne pepper (mL)"
      ],
      [
        473.0,
        "vegetable oil for frying (mL)"
      ]
    ]
  },
  {
    "name": "Cajun Corn and Bacon Maque Choux",
    "description": "This is a Cajun recipe I've had forever! I first prepared it when I was in my high school class in Metairie, Louisiana. It's awesome!",
    "recipeInstructions": [
      "Cut corn off the cobs by thinly slicing across the tops of the kernels; place in a medium bowl. Cut across the kernels again to release milk from the corn, add milk to bowl. Set aside.",
      "Heat the oil in a large skillet over medium-high heat. Add onion and green pepper, cook until onion is transparent, about 5 to 8 minutes. Combine corn, tomatoes, and milk with the onion mixture. Reduce heat to medium low, and cook 20 minutes longer, stirring frequently to prevent sticking. Do not boil. Season with salt and cayenne pepper. Lower heat, cover skillet, and cook 5 to 10 minutes longer. Stir in green onions and bacon. Remove from heat and serve."
    ],
    "prepTimeMinutes": 35,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 65,
    "energyContentCalories": 346.5,
    "fatContentGrams": 21.5,
    "carbohydrateContentGrams": 23.1,
    "proteinContentGrams": 17.9,
    "cholesterolContentMilligrams": 41.9,
    "sodiumContentMilligrams": 884.0,
    "ingredients": [
      [
        6.0,
        "ears corn, husked and cleaned (unit)"
      ],
      [
        30.0,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "large onion, thinly sliced (unit)"
      ],
      [
        236.5,
        "green bell pepper, chopped (mL)"
      ],
      [
        1.0,
        "large fresh tomato, chopped (unit)"
      ],
      [
        59.125,
        "milk (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        0.31,
        "cayenne pepper (mL)"
      ],
      [
        59.125,
        "chopped green onions (mL)"
      ],
      [
        8.0,
        "strip (blank)s strips crisply cooked bacon, crumbled (unit)"
      ]
    ]
  },
  {
    "name": "Banh Mi",
    "description": "A Vietnamese sandwich, made with chicken and full of pickled vegetables. My husband works around a lot of Vietnamese restaurants, and I was making him bring me home these tasty sandwiches. Finally I attempted to make one, and found that my recipe was even better than the restaurants, mainly because I used chicken breast and fresher ingredients. I also love the pickled vegetables, so I made sure there was plenty of those.",
    "recipeInstructions": [
      "Place rice vinegar, water, and sugar into a saucepan over medium heat, bring to a boil, and stir until the sugar has dissolved, about 1 minute. Allow the mixture to cool.",
      "Pour the cooled vinegar mixture over the carrot, radish, and onion in a bowl, and allow to stand for at least 30 minutes. Drain off the excess vinegar mixture after the vegetables have marinated.",
      "While the vegetables are marinating, preheat the oven's broiler, and set the oven rack about 6 inches from the heat source. Lightly oil a slotted broiler pan.",
      "Sprinkle the chicken breast with garlic salt and pepper, and broil on slotted broiler pan, turning once, until the center of the chicken breast is no longer pink and the surface has browned, about 6 minutes per side. Remove the broiled chicken, and slice into bite-size pieces.",
      "Slice the baguette in half the long way, and pull the center of the bread out of the baguette halves, leaving a cavity for the filling. Place the baguette halves under the broiler to lightly toast, 2 to 3 minutes.",
      "To assemble the bahn mi sandwich, spread each half of the toasted baguette with mayonnaise, and fill the cavity of the bottom half of the bread with broiled chicken, cucumber slices, pickled carrot, onion, and radish, cilantro leaves, and jalapeno pepper. Squeeze a wedge of lime over the filling, and top with the other half of the baguette."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 50,
    "energyContentCalories": 657.2,
    "fatContentGrams": 25.2,
    "carbohydrateContentGrams": 85.2,
    "proteinContentGrams": 24.0,
    "cholesterolContentMilligrams": 42.8,
    "sodiumContentMilligrams": 990.0,
    "ingredients": [
      [
        118.25,
        "rice vinegar (mL)"
      ],
      [
        59.125,
        "water (mL)"
      ],
      [
        59.125,
        "sugar (mL)"
      ],
      [
        59.125,
        "carrot, cut into 1/16-inch-thick matchsticks (mL)"
      ],
      [
        59.125,
        "white (daikon) radish, cut into 1/16-inch-thick matchsticks (mL)"
      ],
      [
        59.125,
        "thinly sliced white onion (mL)"
      ],
      [
        1.0,
        "skinless, boneless chicken breast half (unit)"
      ],
      [
        0.31,
        "garlic salt (mL)"
      ],
      [
        0.31,
        "ground black pepper (mL)"
      ],
      [
        1.0,
        "(12 inch) french baguette (unit)"
      ],
      [
        60.0,
        "mayonnaise (mL)"
      ],
      [
        59.125,
        "thinly sliced cucumber  (mL)"
      ],
      [
        15.0,
        "fresh cilantro leaves (mL)"
      ],
      [
        1.0,
        "small jalapeno pepper - seeded and cut into 1/16-inch-thick matchsticks (unit)"
      ],
      [
        1.0,
        "wedge lime (unit)"
      ]
    ]
  },
  {
    "name": "Blueberry Cream Muffins",
    "description": "Rich and delicious blueberry muffins. The secret is the sour cream.",
    "recipeInstructions": [
      "Preheat oven to 400 degrees F (200 degrees C). Grease 24 muffin cups or line with paper muffin liners.",
      "In large bowl beat eggs, gradually add sugar while beating. Continue beating while slowly pouring in oil. Stir in  vanilla. In a separate bowl, stir together flour, salt and baking soda.",
      "Stir dry ingredients into egg mixture alternately with sour cream. Gently fold in blueberries. Scoop batter into prepared muffin cups.",
      "Bake in preheated oven for 20 minutes."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 30,
    "energyContentCalories": 281.0,
    "fatContentGrams": 14.2,
    "carbohydrateContentGrams": 35.2,
    "proteinContentGrams": 3.9,
    "cholesterolContentMilligrams": 39.4,
    "sodiumContentMilligrams": 171.7,
    "ingredients": [
      [
        4.0,
        "egg (unit)"
      ],
      [
        473.0,
        "sugar (mL)"
      ],
      [
        236.5,
        "vegetable oil (mL)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        946.0,
        "all-purpose flour (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        5.0,
        "baking soda (mL)"
      ],
      [
        473.0,
        "sour cream (mL)"
      ],
      [
        473.0,
        "blueberries (mL)"
      ]
    ]
  },
  {
    "name": "Okra with Tomatoes",
    "description": "This is a yummy side dish with rice. Using two types of tomato gives the dish texture and is a tasty explosion of flavors with lots of garlic and crushed red pepper.",
    "recipeInstructions": [
      "Cover the bottom of a skillet with the olive oil and place over medium heat. Place the garlic, onion, and cayenne pepper in the skillet and stir until fragrant. Stir in the green pepper. Cook and stir until tender, about 5 minutes. Stir in the frozen okra and allow to cook for 5 minutes more.  Stir in both the diced and the stewed tomatoes. Season with salt and pepper. Reduce heat to medium-low and simmer until all vegetables are tender, 5 to 7 minutes."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 30,
    "energyContentCalories": 66.3,
    "fatContentGrams": 1.1,
    "carbohydrateContentGrams": 13.1,
    "proteinContentGrams": 2.8,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 311.8,
    "ingredients": [
      [
        5.0,
        "olive oil (mL)"
      ],
      [
        3.0,
        "cloves garlic, minced (unit)"
      ],
      [
        1.0,
        "small onion, minced (unit)"
      ],
      [
        5.0,
        "cayenne pepper (mL)"
      ],
      [
        0.5,
        "green bell pepper, minced (unit)"
      ],
      [
        454.0,
        "frozen sliced okra (g)"
      ],
      [
        1.0,
        "(8 ounce) can canned diced tomatoes (unit)"
      ],
      [
        1.0,
        "(15 ounce) can stewed tomatoes (unit)"
      ],
      [
        1.0,
        "salt and ground black pepper (unit)"
      ]
    ]
  },
  {
    "name": "Peanut Butter Noodles",
    "description": "This is kid friendly with an Asian twist. Can also be made with spaghetti pasta.",
    "recipeInstructions": [
      "Bring a large pot of water to a boil. Add noodles and cook until tender according to package directions. Drain.",
      "Meanwhile, combine chicken broth, ginger, soy sauce, peanut butter, honey, chili paste, and garlic in a small saucepan.  Cook over medium heat until peanut butter melts and is heated through.  Add noodles, and toss to coat.  Garnish with green onions and peanuts."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 25,
    "energyContentCalories": 329.9,
    "fatContentGrams": 12.0,
    "carbohydrateContentGrams": 46.8,
    "proteinContentGrams": 10.7,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 1188.0,
    "ingredients": [
      [
        118.25,
        "chicken broth (mL)"
      ],
      [
        22.5,
        "minced fresh ginger root (mL)"
      ],
      [
        45.0,
        "soy sauce (mL)"
      ],
      [
        45.0,
        "peanut butter (mL)"
      ],
      [
        22.5,
        "honey (mL)"
      ],
      [
        10.0,
        "hot chile paste (mL)"
      ],
      [
        3.0,
        "cloves garlic, minced (unit)"
      ],
      [
        8.0,
        "ounces udon noodles (unit)"
      ],
      [
        59.125,
        "chopped green onions (mL)"
      ],
      [
        59.125,
        "chopped peanuts (mL)"
      ]
    ]
  },
  {
    "name": "Beef and Cabbage (Lazy Golumpki)",
    "description": "Grew up eating golumpki. Yes I'm mostly Polish, but always wanted more sauce on them and didn't like the 'mushiness' of the burger inside. This is the version I came up with and hope you enjoy!",
    "recipeInstructions": [
      "Boil cabbage in a stockpot until tender, 10 to 15 minutes. Drain well.",
      "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix salt, parsley, onion powder, and black pepper into ground beef.",
      "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes. Stir tomato soup and crushed tomatoes together in a bowl.",
      "Preheat oven to 350 degrees F (175 degrees C).",
      "Combine cabbage, seasoned ground beef, rice, and tomato mixture together in a bowl; transfer to a 9x13-inch baking dish.",
      "Bake in the preheated oven until bubbling, about 45 minutes."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 80,
    "totalTimeMinutes": 95,
    "energyContentCalories": 286.7,
    "fatContentGrams": 9.9,
    "carbohydrateContentGrams": 36.7,
    "proteinContentGrams": 14.4,
    "cholesterolContentMilligrams": 34.8,
    "sodiumContentMilligrams": 726.7,
    "ingredients": [
      [
        1.0,
        "head green cabbage, cut into bite-size pieces (unit)"
      ],
      [
        454.0,
        "ground beef (g)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        5.0,
        "dried parsley (mL)"
      ],
      [
        1.25,
        "onion powder (mL)"
      ],
      [
        0.625,
        "ground black pepper (mL)"
      ],
      [
        473.0,
        "water (mL)"
      ],
      [
        236.5,
        "white rice (mL)"
      ],
      [
        1.0,
        "(10.75 ounce) can  condensed tomato soup (such as campbell's®) (unit)"
      ],
      [
        1.0,
        "(32 ounce) container crushed tomatoes (such as hunt's®) (unit)"
      ]
    ]
  },
  {
    "name": "Basic Fruit Smoothie",
    "description": "This is a great smoothie consisting of fruit, fruit juice and ice. I like to use whatever fresh fruits I crave that day. Any kind of berry, mangos, papayas, kiwi fruit, et cetera make a great smoothie. Experiment with your favorites!",
    "recipeInstructions": [
      "In a blender, combine strawberries, banana and peaches. Blend until fruit is pureed. Blend in the juice. Add ice and blend to desired consistency. Pour into glasses and serve."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 15,
    "energyContentCalories": 117.7,
    "fatContentGrams": 0.6,
    "carbohydrateContentGrams": 28.5,
    "proteinContentGrams": 1.6,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 16.2,
    "ingredients": [
      [
        946.0,
        "strawberries, hulled (mL)"
      ],
      [
        1.0,
        "banana, broken into chunks (unit)"
      ],
      [
        2.0,
        "medium (2-1/2\" dia) (approx 4 per lb)s peaches (unit)"
      ],
      [
        236.5,
        "orange-peach-mango juice (mL)"
      ],
      [
        473.0,
        "ice (mL)"
      ]
    ]
  },
  {
    "name": "Tamarind Sauce Fish Curry",
    "description": "Indian-style tangy fish curry. This is famous Chepala Pulusu from Andhra.",
    "recipeInstructions": [
      "Place fish in a bowl; add 1 tablespoon vegetable oil, 1 tablespoon chile powder, turmeric, and 1 1/2 teaspoons salt and allow to marinate for about 10 minutes.",
      "Place tamarind pulp in a bowl and pour warm water over it. Squeeze tamarind to extract juice.",
      "Heat 1/4 cup oil in a skillet over medium heat; add cumin seeds and stir. Add onion to cumin; cook and stir until onion is translucent, 5 to 10 minutes. Add garlic paste and cook for 3 minutes. Add carp, cover the skillet, and cook for 5 minutes.",
      "Mix tamarind juice into fish mixture; bring to a boil. Turn carp pieces; add 2 tablespoons red chile powder, coriander, and salt. Cook over low heat until sauce thickens and oil separates, about 10 minutes. Garnish with coriander leaves."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 25,
    "totalTimeMinutes": 50,
    "energyContentCalories": 359.5,
    "fatContentGrams": 21.1,
    "carbohydrateContentGrams": 12.5,
    "proteinContentGrams": 28.4,
    "cholesterolContentMilligrams": 99.3,
    "sodiumContentMilligrams": 855.6,
    "ingredients": [
      [
        907.0,
        "white carp, cut into large chunks (g)"
      ],
      [
        15.0,
        "vegetable oil (mL)"
      ],
      [
        15.0,
        "red chile powder (mL)"
      ],
      [
        15.0,
        "ground turmeric (mL)"
      ],
      [
        7.5,
        "salt (mL)"
      ],
      [
        59.125,
        "tamarind pulp (mL)"
      ],
      [
        236.5,
        "warm water (mL)"
      ],
      [
        59.125,
        "oil (mL)"
      ],
      [
        2.5,
        "cumin seeds (mL)"
      ],
      [
        1.0,
        "large onion, minced (unit)"
      ],
      [
        22.5,
        "garlic paste (mL)"
      ],
      [
        30.0,
        "red chile powder (mL)"
      ],
      [
        30.0,
        "ground coriander (mL)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        15.0,
        "chopped fresh coriander (cilantro) (mL)"
      ]
    ]
  },
  {
    "name": "Grilled Salmon I",
    "description": "A simple soy sauce and brown sugar marinade, with hints of lemon and garlic, are the perfect salty-sweet complement to rich salmon fillets. Even my 9 year old loves this recipe!",
    "recipeInstructions": [
      "Season salmon fillets with lemon pepper, garlic powder, and salt.",
      "In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.",
      "Preheat grill for medium heat.",
      "Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 16,
    "totalTimeMinutes": 151,
    "energyContentCalories": 317.9,
    "fatContentGrams": 20.1,
    "carbohydrateContentGrams": 13.2,
    "proteinContentGrams": 20.5,
    "cholesterolContentMilligrams": 55.8,
    "sodiumContentMilligrams": 1091.8,
    "ingredients": [
      [
        680.0,
        "salmon fillets (g)"
      ],
      [
        2.5,
        "lemon pepper (mL)"
      ],
      [
        1.25,
        "garlic powder (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        78.8255,
        "soy sauce (mL)"
      ],
      [
        78.8255,
        "brown sugar (mL)"
      ],
      [
        78.8255,
        "water (mL)"
      ],
      [
        59.125,
        "vegetable oil (mL)"
      ]
    ]
  },
  {
    "name": "Blueberry Pie",
    "description": "This is the best when made with fresh picked blueberries! It is a beautiful sight with a lattice top.",
    "recipeInstructions": [
      "Preheat oven to 375 degrees F (190 degrees C).",
      "Mix sugar, cornstarch, salt, and cinnamon, and sprinkle over blueberries.",
      "Line pie dish with one pie crust.  Pour berry mixture into the crust, and dot with butter.  Cut remaining pastry into 1/2 - 3/4 inch wide strips, and make lattice top.  Crimp and flute edges.",
      "Bake pie on lower shelf of oven for about 50 minutes, or until crust is golden brown."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 50,
    "totalTimeMinutes": 65,
    "energyContentCalories": 365.9,
    "fatContentGrams": 16.6,
    "carbohydrateContentGrams": 52.6,
    "proteinContentGrams": 3.3,
    "cholesterolContentMilligrams": 3.8,
    "sodiumContentMilligrams": 317.7,
    "ingredients": [
      [
        177.375,
        "sugar (mL)"
      ],
      [
        45.0,
        "cornstarch (mL)"
      ],
      [
        1.25,
        "salt (mL)"
      ],
      [
        2.5,
        "ground cinnamon (mL)"
      ],
      [
        946.0,
        "fresh blueberries (mL)"
      ],
      [
        1.0,
        "recipe pastry for a 9 inch double crust pie (unit)"
      ],
      [
        15.0,
        "butter (mL)"
      ]
    ]
  },
  {
    "name": "Sesame Seared Tuna",
    "description": "Easy, great tasting tuna coated with sesame seeds, and quickly seared. This tuna is served rare, so be sure to use a good quality fresh tuna.",
    "recipeInstructions": [
      "In a small bowl, stir together the soy sauce, mirin, honey and sesame oil. Divide into two equal parts. Stir the rice vinegar into one part and set aside as a dipping sauce.",
      "Spread the sesame seeds out on a plate. Coat the tuna steaks with the remaining soy sauce mixture, then press into the sesame seeds to coat.",
      "Heat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan, and sear for about 30 seconds on each side. Serve with the dipping sauce and wasabi paste."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 20,
    "energyContentCalories": 422.2,
    "fatContentGrams": 20.7,
    "carbohydrateContentGrams": 13.2,
    "proteinContentGrams": 44.1,
    "cholesterolContentMilligrams": 77.2,
    "sodiumContentMilligrams": 1045.5,
    "ingredients": [
      [
        59.125,
        "soy sauce (mL)"
      ],
      [
        15.0,
        "mirin (japanese sweet wine) (mL)"
      ],
      [
        15.0,
        "honey (mL)"
      ],
      [
        30.0,
        "sesame oil (mL)"
      ],
      [
        15.0,
        "rice wine vinegar (mL)"
      ],
      [
        4.0,
        "(6 ounce) tuna steaks (unit)"
      ],
      [
        118.25,
        "sesame seeds (mL)"
      ],
      [
        15.0,
        "wasabi paste (mL)"
      ],
      [
        15.0,
        "olive oil (mL)"
      ]
    ]
  },
  {
    "name": "Joy's Easy Banana Bread",
    "description": "This easy banana bread recipe is quick to prepare, and everyone always comes back for seconds!",
    "recipeInstructions": [
      "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.",
      "Combine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. Stir salt into batter. Pour batter into the prepared loaf pan.",
      "Bake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 60,
    "totalTimeMinutes": 75,
    "energyContentCalories": 225.0,
    "fatContentGrams": 5.4,
    "carbohydrateContentGrams": 42.4,
    "proteinContentGrams": 3.0,
    "cholesterolContentMilligrams": 30.8,
    "sodiumContentMilligrams": 398.8,
    "ingredients": [
      [
        3.0,
        "medium (7\" to 7-7/8\" long)s ripe bananas, mashed (unit)"
      ],
      [
        236.5,
        "sugar (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        59.125,
        "melted butter (mL)"
      ],
      [
        354.75,
        "all-purpose flour (mL)"
      ],
      [
        5.0,
        "baking soda (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ]
    ]
  },
  {
    "name": "Syrian Rice with Meat",
    "description": "A Syrian rice dish with spiced meat and pine nuts.",
    "recipeInstructions": [
      "Heat 1/4 cup butter in a large saucepan over medium-high heat. Add ground beef and mix in salt, allspice, cinnamon, and black pepper. Cook until beef is browned, 7 to 10 minutes.",
      "Add chicken broth and rice to the saucepan. Cover and bring to a boil. Reduce heat to low and cook until liquid is absorbed, about 20 minutes.",
      "Meanwhile, melt 2 tablespoons butter in a small skillet over medium heat. Add pine nuts and cook until lightly browned, 3 to 5 minutes.",
      "Mix pine nuts into rice and meat mixture before serving."
    ],
    "prepTimeMinutes": 5,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 40,
    "energyContentCalories": 673.8,
    "fatContentGrams": 35.9,
    "carbohydrateContentGrams": 52.2,
    "proteinContentGrams": 33.5,
    "cholesterolContentMilligrams": 126.9,
    "sodiumContentMilligrams": 1820.5,
    "ingredients": [
      [
        59.125,
        "butter (mL)"
      ],
      [
        907.0,
        "ground beef (g)"
      ],
      [
        10.0,
        "salt (mL)"
      ],
      [
        2.5,
        "ground allspice (mL)"
      ],
      [
        2.5,
        "ground cinnamon (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        1064.25,
        "chicken broth (mL)"
      ],
      [
        473.0,
        "long grain white rice (mL)"
      ],
      [
        30.0,
        "butter (mL)"
      ],
      [
        118.25,
        "pine nuts (mL)"
      ]
    ]
  },
  {
    "name": "Orange Cake with Semolina and Almonds",
    "description": "Semolina and ground almonds give this cake a luxurious weight and the whole oranges provide moisture and a sunny citrus flavor without using any dairy. The cake can be stored in an airtight container for up to 2 days.",
    "recipeInstructions": [
      "Combine chopped oranges and 1 tablespoon water in a small saucepan, cover, and cook over medium-low heat until oranges are soft and excess liquid has evaporated, about 30 minutes. Set aside to cool, about 20 minutes.",
      "Preheat oven to 350 degrees F (175 degrees C). Line the bottom and sides of an 8-inch springform pan with parchment paper.",
      "Place oranges in the bowl of a food processor; pulse until finely chopped.",
      "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Gradually add 1/2 cup sugar, continuing to beat for 1 more minute.",
      "Beat egg yolks and remaining 1/2 cup sugar in a separate bowl until pale and thick, 2 to 3 minutes. Whisk in finely chopped oranges. Fold in ground almonds, semolina, vanilla extract, and fiori di Sicilia. Stir in 3 spoonfuls of whisked egg white to loosen the batter. Gently fold in remaining egg whites with a spatula or large metal spoon. Pour batter into prepared springform and level the top.",
      "Bake in the preheated oven until cake is golden and a skewer inserted in the center comes out clean, about 50 minutes. Check cake after 20 and 30 minutes to see if it is starting to brown too quickly. Cover top lightly with aluminum foil once cake starts to brown.",
      "Remove from oven and cool in the pan. Remove ring, peel away parchment paper and transfer cake to a serving plate. Drizzle with liqueur and dust with confectioners' sugar."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 80,
    "totalTimeMinutes": 130,
    "energyContentCalories": 200.9,
    "fatContentGrams": 7.2,
    "carbohydrateContentGrams": 28.5,
    "proteinContentGrams": 5.5,
    "cholesterolContentMilligrams": 93.0,
    "sodiumContentMilligrams": 35.3,
    "ingredients": [
      [
        2.0,
        "large  organic oranges, scrubbed and coarsely chopped (with the skin) (unit)"
      ],
      [
        5.0,
        " large eggs eggs, separated (unit)"
      ],
      [
        236.5,
        "sugar (mL)"
      ],
      [
        177.375,
        "ground almonds (mL)"
      ],
      [
        177.375,
        "semolina flour (mL)"
      ],
      [
        2.5,
        "vanilla extract (mL)"
      ],
      [
        2.5,
        "fiori di sicilia (optional) (mL)"
      ],
      [
        45.0,
        "brandy-based orange liqueur (such as grand marnier®) (mL)"
      ],
      [
        2.5,
        "powdered sugar (mL)"
      ]
    ]
  },
  {
    "name": "Sweet Potato and Venison Shepherd's Pie",
    "description": "A hearty, warming, and comforting venison shepherd's pie that's perfect for opening day!",
    "recipeInstructions": [
      "Preheat the oven to 375 degrees F (190 degrees C).",
      "Pierce the sweet potato several times with a fork and wrap in aluminum foil. Place on a baking sheet.",
      "Roast in the preheated oven until sweet potato is fork-tender, 70 to 90 minutes. Remove from the oven and let cool enough to handle, 5 to 10 minutes.",
      "Reduce oven temperature to 350 degrees F (175 degrees C). Lightly grease a 9-inch deep-dish pie plate and place on a rimmed baking sheet to prevent bubbling over.",
      "Peel skin off the sweet potato and place flesh into a large bowl. Add butter, milk, salt, pepper, sage, and nutmeg. Beat using an electric mixer until ingredients are combined. Mix in Cheddar cheese gently. Set aside.",
      "Heat vegetable oil in a Dutch oven over medium-high heat. Add mushrooms, onion, carrots, celery, and garlic. Sprinkle with salt. Cook until vegetables have softened, 5 to 7 minutes. Add venison, thyme, oregano, garlic powder, onion powder, 1/2 teaspoon salt, pepper, and sage. Stir to combine, breaking up any large pieces of venison. Cook until venison is no longer pink, 5 to 7 minutes.",
      "Stir flour into the pot and cook for 1 minute. Pour in white wine and stir to loosen any browned bits from the bottom of the pan. Cook until wine has reduced slightly, 2 to 3 minutes. Stir in broth. Allow mixture to come to a simmer; continue to cook until filling has thickened, 5 to 10 minutes. Stir in peas. Taste and adjust salt and pepper as necessary. Remove from heat and let cool slightly.",
      "Pour filling into the prepared pie plate. Top with sweet potato mixture and spread gently across the top, covering most of the filling.",
      "Bake in the preheated oven until top is set and filling is bubbling, about 30 minutes. Allow to cool slightly before serving."
    ],
    "prepTimeMinutes": 45,
    "cookTimeMinutes": 120,
    "totalTimeMinutes": 170,
    "energyContentCalories": 358.3,
    "fatContentGrams": 14.2,
    "carbohydrateContentGrams": 29.5,
    "proteinContentGrams": 23.1,
    "cholesterolContentMilligrams": 76.2,
    "sodiumContentMilligrams": 444.9,
    "ingredients": [
      [
        1.0,
        "large sweet potato (unit)"
      ],
      [
        30.0,
        "unsalted butter, softened (mL)"
      ],
      [
        30.0,
        "milk (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        1.25,
        "ground black pepper (mL)"
      ],
      [
        1.25,
        "dried sage (mL)"
      ],
      [
        0.31,
        "freshly ground nutmeg (mL)"
      ],
      [
        118.25,
        "shredded sharp cheddar cheese (mL)"
      ],
      [
        30.0,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "(8 ounce) package cremini mushrooms, sliced (unit)"
      ],
      [
        1.0,
        "large onion, chopped (unit)"
      ],
      [
        2.0,
        "medium (blank)s carrots, peeled and chopped (unit)"
      ],
      [
        1.0,
        "stalk celery, chopped (unit)"
      ],
      [
        4.0,
        "cloves garlic, chopped (unit)"
      ],
      [
        0.31,
        "salt (mL)"
      ],
      [
        454.0,
        "ground venison (g)"
      ],
      [
        5.0,
        "dried thyme (mL)"
      ],
      [
        5.0,
        "dried oregano (mL)"
      ],
      [
        5.0,
        "garlic powder (mL)"
      ],
      [
        5.0,
        "onion powder (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        2.5,
        "dried sage (mL)"
      ],
      [
        30.0,
        "all-purpose flour (mL)"
      ],
      [
        157.6745,
        "dry white wine (mL)"
      ],
      [
        236.5,
        "low-sodium chicken broth (mL)"
      ],
      [
        236.5,
        "frozen peas (mL)"
      ]
    ]
  },
  {
    "name": "Keto Pumpkin Cheesecake with Almond Pecan Crust",
    "description": "This recipe is a yummy and rich-tasting cross between my decades-old cheesecake recipe and pumpkin pie, converted to be low-carb. I also use low-fat cream cheese to reduce the amount of fat. It's wonderful for Thanksgiving, or just for fun anytime. Unless you tell people it's low-carb, they'll never guess!",
    "recipeInstructions": [
      "Preheat the oven to 350 degrees F (175 degrees C).",
      "Pulse almonds and pecans together in a food processor until ground, but not paste-like. Add sweetener and butter; pulse to combine. Press mixture into the bottom of a 9-inch springform pan.",
      "Bake in the preheated oven until crust is golden brown, about 10 minutes. Let cool 10 minutes.",
      "Blend cream cheese and 2/3 cup sweetener in food processor or with an electric mixer until smooth, 2 to 3 minutes. Mix in pumpkin, vanilla extract, cinnamon, ginger, cloves, and salt until smooth, about 2 minutes more. Add in eggs one at a time, mixing thoroughly after each addition. Pour batter into the prepared crust.",
      "Bake in the preheated oven until just set in the center, or when the filling jiggles but does not run, 45 to 50 minutes. Let cool completely, about 30 minutes. Run a knife around the edge of the cheesecake, cover, and refrigerate at least 4 hours, until ready to serve."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 55,
    "totalTimeMinutes": 345,
    "energyContentCalories": 244.6,
    "fatContentGrams": 20.5,
    "carbohydrateContentGrams": 8.5,
    "proteinContentGrams": 8.6,
    "cholesterolContentMilligrams": 64.5,
    "sodiumContentMilligrams": 255.3,
    "ingredients": [
      [
        236.5,
        "almonds (mL)"
      ],
      [
        236.5,
        "pecans (mL)"
      ],
      [
        2.0,
        "(1 gram) packets granular sucralose sweetener (such as splenda®) (unit)"
      ],
      [
        45.0,
        "butter, melted (mL)"
      ],
      [
        3.0,
        "(8 ounce) packages low-fat cream cheese, at room temperature (unit)"
      ],
      [
        157.6745,
        "granular sucralose sweetener (such as splenda®) (mL)"
      ],
      [
        1.0,
        "(15 ounce) can pumpkin puree (unit)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        5.0,
        "ground cinnamon (mL)"
      ],
      [
        2.5,
        "ground ginger (mL)"
      ],
      [
        1.25,
        "ground cloves (mL)"
      ],
      [
        1.25,
        "salt (mL)"
      ],
      [
        3.0,
        "egg (unit)"
      ]
    ]
  },
  {
    "name": "Sensational Steak Sandwich",
    "description": "If you are looking for an outstanding, easy to make sandwich, then this is the recipe for you.",
    "recipeInstructions": [
      "Heat the oil in a large skillet over medium heat. Add the beef, and cook until browned. Add the mushrooms, bell pepper and onion; cook and stir until starting to become tender, about 5 minutes.",
      "In a slow cooker, combine the beef broth, salt, pepper, Worcestershire sauce, red pepper flakes and red wine. Transfer the beef and vegetables to the slow cooker, and stir to blend. Cover, and cook on High for 3 to 4 hours, until beef is extremely tender.",
      "Preheat the oven to 425 degrees F (220 degrees C). Drain the liquid from the slow cooker, and save for dipping. Slice the French bread loaf lengthwise like a submarine sandwich. Mix together the horseradish and mustard; spread onto the inside of the loaf. Place slices of provolone cheese on both sides of the loaf, then fill with the beef and vegetables. Close the loaf, and wrap the entire sandwich with aluminum foil.",
      "Bake for 10 to 15 minutes in the preheated oven. For crunchier bread, you can bake it without the aluminum foil. Slice into servings, and serve with the juices from the slow cooker for dipping."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 260,
    "totalTimeMinutes": 290,
    "energyContentCalories": 908.1,
    "fatContentGrams": 40.6,
    "carbohydrateContentGrams": 78.8,
    "proteinContentGrams": 55.7,
    "cholesterolContentMilligrams": 109.2,
    "sodiumContentMilligrams": 2586.4,
    "ingredients": [
      [
        30.0,
        "olive oil (mL)"
      ],
      [
        454.0,
        "thinly sliced sirloin steak strips (g)"
      ],
      [
        8.0,
        "ounces sliced fresh mushrooms (unit)"
      ],
      [
        1.0,
        "green bell pepper, seeded and cut into strips (unit)"
      ],
      [
        1.0,
        "medium onion, sliced (unit)"
      ],
      [
        10.0,
        "slices provolone cheese (unit)"
      ],
      [
        1.0,
        "loaf french bread (unit)"
      ],
      [
        1.0,
        "(14 ounce) can beef broth (unit)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        2.5,
        "garlic powder (mL)"
      ],
      [
        30.0,
        "worcestershire sauce (mL)"
      ],
      [
        0.625,
        "red pepper flakes (mL)"
      ],
      [
        59.125,
        "pinot noir or other dry red wine (mL)"
      ],
      [
        118.25,
        "prepared horseradish (mL)"
      ],
      [
        118.25,
        "brown mustard (mL)"
      ]
    ]
  },
  {
    "name": "Burrito Pie",
    "description": "This is a lot like a lasagna, only Mexican-style! Serve like a pie and garnish with sour cream, salsa, lettuce and tomato. Make sure you like spicy foods before trying this one. It's hot!",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "In a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.",
      "Spread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.",
      "Bake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 60,
    "energyContentCalories": 431.6,
    "fatContentGrams": 23.9,
    "carbohydrateContentGrams": 33.3,
    "proteinContentGrams": 19.8,
    "cholesterolContentMilligrams": 67.9,
    "sodiumContentMilligrams": 847.4,
    "ingredients": [
      [
        907.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "onion, chopped (unit)"
      ],
      [
        10.0,
        "minced garlic (mL)"
      ],
      [
        1.0,
        "(2 ounce) can black olives, sliced (unit)"
      ],
      [
        1.0,
        "(4 ounce) can diced green chili peppers (unit)"
      ],
      [
        1.0,
        "(10 ounce) can diced tomatoes with green chile peppers (unit)"
      ],
      [
        1.0,
        "(16 ounce) jar taco sauce (unit)"
      ],
      [
        2.0,
        "(16 ounce) cans refried beans (unit)"
      ],
      [
        12.0,
        "(8 inch) flour tortillas (unit)"
      ],
      [
        9.0,
        "ounces shredded colby cheese (unit)"
      ]
    ]
  },
  {
    "name": "Healthy Chicken Salad",
    "description": "A protein-packed alternative to the normal chicken salad. This one is healthier, quick, and easy to make. I peeled my apple, personal preference, but feel free to add it unpeeled.",
    "recipeInstructions": [
      "Combine Greek yogurt, cottage cheese, celery, apple, cranberries, onion, pecans, and Dijon mustard in a bowl; stir until well combined. Mix in chicken and season with salt and pepper."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 15,
    "energyContentCalories": 168.0,
    "fatContentGrams": 6.3,
    "carbohydrateContentGrams": 12.9,
    "proteinContentGrams": 14.6,
    "cholesterolContentMilligrams": 28.5,
    "sodiumContentMilligrams": 247.6,
    "ingredients": [
      [
        1.0,
        "(6 ounce) container fat-free greek yogurt (such as fage®) (unit)"
      ],
      [
        118.25,
        "low-fat cottage cheese (mL)"
      ],
      [
        118.25,
        "chopped celery (mL)"
      ],
      [
        118.25,
        "diced apple (mL)"
      ],
      [
        59.125,
        "sweetened dried cranberries (such as craisins®) (mL)"
      ],
      [
        30.0,
        "chopped onion (mL)"
      ],
      [
        30.0,
        "chopped pecans (mL)"
      ],
      [
        7.5,
        "dijon mustard (mL)"
      ],
      [
        295.625,
        "cubed, cooked chicken (mL)"
      ],
      [
        0.31,
        "salt and ground black pepper (mL)"
      ]
    ]
  },
  {
    "name": "Meatball Sub Casserole",
    "description": "My boys LOVE this! It is quick and simple! I am always asked to bring this to Super Bowl® parties and family events!",
    "recipeInstructions": [
      "Preheat oven to 425 degrees F (220 degrees C).",
      "Heat garlic bread with spread side up on a baking sheet in the preheated oven until warm and golden brown, 10 to 12 minutes. Set aside to cool.",
      "Reduce oven temperature to 350 degrees F (175 degrees C).",
      "Bring spaghetti sauce to a boil in a large pot. Place frozen meatballs into sauce. Reduce heat to low and simmer until meatballs are heated through, about 20 minutes.",
      "Tear garlic bread into bite-size pieces and spread into bottom of a 9x13-inch baking dish. Pour spaghetti sauce and meatballs over garlic bread, coating bread with sauce and distributing meatballs evenly. Spread mozzarella cheese over top in a layer, followed by a layer of Parmesan cheese.",
      "Bake casserole until cheese has melted, 20 to 25 minutes."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 50,
    "totalTimeMinutes": 60,
    "energyContentCalories": 733.1,
    "fatContentGrams": 37.2,
    "carbohydrateContentGrams": 58.0,
    "proteinContentGrams": 39.1,
    "cholesterolContentMilligrams": 139.9,
    "sodiumContentMilligrams": 1385.9,
    "ingredients": [
      [
        1.0,
        "(16 ounce) package frozen garlic bread (unit)"
      ],
      [
        2.0,
        "(24 ounce) jars spaghetti sauce (unit)"
      ],
      [
        40.0,
        "eaches italian-style frozen meatballs (unit)"
      ],
      [
        473.0,
        "shredded mozzarella cheese (mL)"
      ],
      [
        59.125,
        "grated parmesan cheese (mL)"
      ]
    ]
  },
  {
    "name": "Gumbo Style Chicken Creole",
    "description": "Delicious chicken gumbo consistency with tomato base. Makes plenty to last for several days. Serve over hot cooked rice and sprinkle with filé powder, if desired.",
    "recipeInstructions": [
      "Heat oil in a large skillet over high heat. Stir in flour and cook, stirring constantly, for 5 minutes or until mixture is the color of a copper penny. Reduce heat to low and stir in bell pepper and onion. Cook 10 to 15 minutes, or until tender, stirring occasionally.",
      "Add chicken, tomatoes with green chile peppers, mushrooms, parsley, Worcestershire sauce, garlic, soy sauce, sugar, salt, pepper and hot sauce. Stir together, cover and simmer for 20 minutes. Add chicken broth or water if mixture is too thick for your liking."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 45,
    "totalTimeMinutes": 60,
    "energyContentCalories": 136.5,
    "fatContentGrams": 9.4,
    "carbohydrateContentGrams": 12.3,
    "proteinContentGrams": 2.1,
    "cholesterolContentMilligrams": 0.5,
    "sodiumContentMilligrams": 735.0,
    "ingredients": [
      [
        59.125,
        "vegetable oil (mL)"
      ],
      [
        59.125,
        "all-purpose flour (mL)"
      ],
      [
        1.0,
        "green bell pepper, chopped (unit)"
      ],
      [
        1.0,
        "medium onion, chopped (unit)"
      ],
      [
        473.0,
        "cooked chicken, chopped (mL)"
      ],
      [
        1.0,
        "(14.5 ounce) can diced tomatoes with green chile peppers, with liquid (unit)"
      ],
      [
        1.0,
        "(4.5 ounce) can sliced mushrooms, drained (unit)"
      ],
      [
        30.0,
        "chopped fresh parsley (mL)"
      ],
      [
        10.0,
        "worcestershire sauce (mL)"
      ],
      [
        3.0,
        "cloves garlic, minced (unit)"
      ],
      [
        5.0,
        "soy sauce (mL)"
      ],
      [
        5.0,
        "sugar (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        3.0,
        "dashes hot sauce (unit)"
      ],
      [
        118.25,
        "chicken broth (mL)"
      ]
    ]
  },
  {
    "name": "How to Make Vanilla Ice Cream",
    "description": "Vanilla is the king of ice cream flavors. This version without eggs ('American' or 'Philadelphia-style') has a brighter, more pronounced vanilla flavor.",
    "recipeInstructions": [
      "Stir sugar, cream, and milk into a saucepan over low heat until sugar has dissolved. Heat just until mix is hot and a small ring of foam appears around the edge.",
      "Transfer cream mixture to a pourable container such as a large measuring cup. Stir in vanilla extract and chill mix thoroughly, at least 2 hours. (Overnight is best.)",
      "Pour cold ice cream mix into an ice cream maker, turn on the machine, and churn according to manufacturer's directions, 20 to 25 minutes.",
      "When ice cream is softly frozen, serve immediately or place a piece of plastic wrap directly on the ice cream and place in freezer to ripen, 2 to 3 hours."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 155,
    "energyContentCalories": 425.3,
    "fatContentGrams": 24.7,
    "carbohydrateContentGrams": 45.8,
    "proteinContentGrams": 5.8,
    "cholesterolContentMilligrams": 92.5,
    "sodiumContentMilligrams": 79.1,
    "ingredients": [
      [
        177.375,
        "sugar (mL)"
      ],
      [
        236.5,
        "heavy whipping cream (mL)"
      ],
      [
        532.125,
        "milk (mL)"
      ],
      [
        10.0,
        "vanilla extract (mL)"
      ]
    ]
  },
  {
    "name": "Instant Pot® Sweet and Sour Pork",
    "description": "Sweet and sour pork is a traditional and delicious Chinese dish. There's no need for takeout when you can make it with very little effort at home, and even better, in the Instant Pot®. Serve with rice.",
    "recipeInstructions": [
      "Turn on a multi-functional pressure cooker (such as an Instant Pot&reg;) and select Saute function. Add oil and heat until hot. Add pork cubes, working in batches if necessary, and cook until browned on all sides, about 5 minutes. Return all the pork back to the pot and cancel Saute mode.",
      "Whisk together 3/4 cup water, ketchup, rice vinegar, pineapple juice, brown sugar, soy sauce, ginger, and garlic in a small bowl. Pour over pork and stir to combine.",
      "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Release pressure using the natural-release method according to manufacturer's instructions, about 5 minutes. Release remaining pressure using the quick-release method. Unlock the lid and remove. Transfer pork to a plate using a slotted spoon. Cover with foil to keep warm.",
      "Select Saute mode and stir in onion, pineapple, and red and green bell peppers. Simmer until vegetables start to soften, 6 to 7 minutes.",
      "Whisk together cornstarch and remaining 1/2 cup water in a small bowl until smooth. Pour slurry into the pot. Cook, stirring constantly, until sauce has thickened to your preferred consistency, about 2 minutes. Return cooked pork back to the pot and heat until just warmed through. Garnish with sesame seeds."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 40,
    "totalTimeMinutes": 70,
    "energyContentCalories": 328.7,
    "fatContentGrams": 11.4,
    "carbohydrateContentGrams": 36.0,
    "proteinContentGrams": 22.1,
    "cholesterolContentMilligrams": 54.3,
    "sodiumContentMilligrams": 648.8,
    "ingredients": [
      [
        15.0,
        "vegetable oil (mL)"
      ],
      [
        454.0,
        "boneless pork loin, cut into 3/4-inch cubes (g)"
      ],
      [
        295.625,
        "water (mL)"
      ],
      [
        118.25,
        "ketchup (mL)"
      ],
      [
        78.8255,
        "rice vinegar (mL)"
      ],
      [
        78.8255,
        "pineapple juice (mL)"
      ],
      [
        30.0,
        "brown sugar (mL)"
      ],
      [
        30.0,
        "low-sodium soy sauce (mL)"
      ],
      [
        10.0,
        "minced fresh ginger (mL)"
      ],
      [
        5.0,
        "minced garlic (mL)"
      ],
      [
        1.0,
        "aluminum foil (unit)"
      ],
      [
        1.0,
        "onion, vertically sliced (unit)"
      ],
      [
        236.5,
        "chopped fresh pineapple (mL)"
      ],
      [
        1.0,
        "red bell pepper, cut into large chunks (unit)"
      ],
      [
        1.0,
        "green bell pepper, cut into large chunks (unit)"
      ],
      [
        30.0,
        "cornstarch (mL)"
      ],
      [
        15.0,
        "toasted sesame seeds (mL)"
      ]
    ]
  },
  {
    "name": "Shrimp Egg Foo Young",
    "description": "A recipe making egg foo young patties and a delicious sauce to put on top. This is a very special recipe acquired when I worked at a Chinese restaurant to pay for my red '66 VW bug when in high school! The recipe card is tattered and spotted now, but the dish is the best egg foo young I have ever had. Hope you enjoy it too! To serve, place egg patty over steamed rice and put the sauce on top.",
    "recipeInstructions": [
      "Beat together the eggs, bean sprouts, green onions, shrimp, and garlic powder in a bowl until well-combined. Heat the oil in a skillet over medium heat, and scoop about 1/2 cup of the egg mixture into the skillet to make a patty. Fry until golden brown, about 4 minutes per side, and repeat with the remaining egg mixture. Set the patties aside.",
      "Whisk together the chicken broth, cornstarch, sugar, vinegar, and soy sauce in a saucepan over medium-low heat until the sauce simmers and thickens, about 5 minutes. Spoon the sauce over the patties."
    ],
    "prepTimeMinutes": 5,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 20,
    "energyContentCalories": 227.4,
    "fatContentGrams": 12.3,
    "carbohydrateContentGrams": 15.0,
    "proteinContentGrams": 15.4,
    "cholesterolContentMilligrams": 248.4,
    "sodiumContentMilligrams": 597.8,
    "ingredients": [
      [
        4.0,
        "egg (unit)"
      ],
      [
        8.0,
        "ounces fresh bean sprouts (unit)"
      ],
      [
        78.8255,
        "thinly sliced green onions (mL)"
      ],
      [
        236.5,
        "cooked small shrimp (mL)"
      ],
      [
        1.25,
        "garlic powder (mL)"
      ],
      [
        30.0,
        "vegetable oil (mL)"
      ],
      [
        709.5,
        "chicken broth (mL)"
      ],
      [
        30.0,
        "cornstarch (mL)"
      ],
      [
        30.0,
        "sugar (mL)"
      ],
      [
        30.0,
        "white vinegar (mL)"
      ],
      [
        30.0,
        "soy sauce (mL)"
      ]
    ]
  },
  {
    "name": "Low-Carb \"Tacos\"",
    "description": "This is a great low-carb alternative to your standard homemade tacos. I love Mexican food and wasn't willing to part with tacos after starting my low-carb diet. This always satisfies my craving.",
    "recipeInstructions": [
      "Cook and stir ground beef, onion, and jalapeno peppers together in a skillet over medium-high heat until meat is browned and crumbly, 7 to 10 minutes. Stir taco seasoning into meat mixture; bring to a simmer and cook until flavors combine, about 5 minutes.",
      "Stir meat mixture, shredded lettuce, tomato, Cheddar cheese, salsa, and sour cream together in a large bowl. Divide taco mixture among 4 bowls and top each with avocado slices."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 35,
    "energyContentCalories": 520.8,
    "fatContentGrams": 34.9,
    "carbohydrateContentGrams": 16.3,
    "proteinContentGrams": 34.9,
    "cholesterolContentMilligrams": 114.9,
    "sodiumContentMilligrams": 1061.9,
    "ingredients": [
      [
        680.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "onion, diced (unit)"
      ],
      [
        0.5,
        "(4 ounce) can diced jalapeno peppers (unit)"
      ],
      [
        1.0,
        "(1 ounce) package taco seasoning mix (unit)"
      ],
      [
        473.0,
        "shredded lettuce (mL)"
      ],
      [
        1.0,
        "tomato, chopped (unit)"
      ],
      [
        118.25,
        "shredded reduced-fat cheddar cheese (mL)"
      ],
      [
        59.125,
        "salsa (mL)"
      ],
      [
        59.125,
        "low-fat sour cream (mL)"
      ],
      [
        1.0,
        "avocado - peeled, pitted, and sliced (unit)"
      ]
    ]
  },
  {
    "name": "The Best Canning Salsa",
    "description": "This is a great use for tomatoes from the garden and nothing tastes better than homemade. Enjoy!",
    "recipeInstructions": [
      "Combine tomatoes, onions, vinegar, tomato paste, green bell peppers, red bell peppers, banana peppers, sugar, garlic, pickling salt, and black pepper in a large stockpot; bring to a boil, reduce heat to medium-low, and simmer for 30 minutes. Mix cilantro into salsa.",
      "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack salsa into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
      "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 35 minutes.",
      "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "prepTimeMinutes": 25,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 90,
    "energyContentCalories": 143.5,
    "fatContentGrams": 0.9,
    "carbohydrateContentGrams": 32.8,
    "proteinContentGrams": 5.1,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 1325.3,
    "ingredients": [
      [
        30.0,
        "eaches tomatoes, peeled and chopped (unit)"
      ],
      [
        2365.0,
        "chopped onions (mL)"
      ],
      [
        473.0,
        "vinegar (mL)"
      ],
      [
        2.0,
        "(8 ounce) cans tomato paste (unit)"
      ],
      [
        2.0,
        "eaches green bell peppers, chopped (unit)"
      ],
      [
        2.0,
        "eaches red bell peppers, chopped (unit)"
      ],
      [
        4.0,
        "medium (4-1/2\" long)s banana peppers, chopped (unit)"
      ],
      [
        118.25,
        "sugar (mL)"
      ],
      [
        10.0,
        "cloves garlic, chopped (unit)"
      ],
      [
        40.0,
        "pickling salt (mL)"
      ],
      [
        10.0,
        "ground black pepper (mL)"
      ],
      [
        0.5,
        "bunch fresh cilantro, chopped (unit)"
      ],
      [
        17.0,
        "eaches (1 pint) canning jars with lids and rings (unit)"
      ]
    ]
  },
  {
    "name": "Can't Wait Microwave Lava Cake",
    "description": "This fudgy, easy can't-wait microwave lava cake is ready in only 7 minutes and uses cake mix and prepared frosting in the can. Mind blowing!",
    "recipeInstructions": [
      "Grease a microwave-safe bowl or ramekins with nonstick cooking spray.",
      "Combine cake mix, water, eggs, and oil in a large bowl and beat with an electric blender on low speed until moistened, about 30 seconds. Increase to medium speed and beat for 2 minutes. Stir walnuts and chocolate chips into the batter. Pour half of the batter into the prepared microwave safe bowl or ramekins.",
      "Spoon chocolate frosting over the batter and spread evenly over the top. Pour the rest of the batter on top.",
      "Microwave until a toothpick inserted in the middle of the cake comes out clean, 7 minutes for a bowl or 3 to 4 minutes for smaller ramekins. Remove from microwave and let rest, about 5 minutes. Dust with confectioners' sugar."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 7,
    "totalTimeMinutes": 22,
    "energyContentCalories": 1526.2,
    "fatContentGrams": 87.0,
    "carbohydrateContentGrams": 183.4,
    "proteinContentGrams": 18.7,
    "cholesterolContentMilligrams": 139.5,
    "sodiumContentMilligrams": 994.2,
    "ingredients": [
      [
        1.0,
        "cooking spray (serving)"
      ],
      [
        1.0,
        "(15.25 ounce) package spiced cake mix (such as betty crocker®) (unit)"
      ],
      [
        236.5,
        "water (mL)"
      ],
      [
        3.0,
        "egg (unit)"
      ],
      [
        78.8255,
        "vegetable oil (mL)"
      ],
      [
        236.5,
        "chopped walnuts (mL)"
      ],
      [
        236.5,
        "semisweet chocolate chips (mL)"
      ],
      [
        1.0,
        "(16 ounce) can prepared chocolate frosting (unit)"
      ],
      [
        15.0,
        "powdered sugar (mL)"
      ]
    ]
  },
  {
    "name": "Spinach-Ricotta Quiche",
    "description": "This savory quiche is perfect for breakfast, brunch, lunch, or served with a side salad for a light dinner. It's light and fluffy with a creamy texture, and bursting with delicious flavors!",
    "recipeInstructions": [
      "Melt butter in a skillet over medium heat; add onion and cook for 1 minute. Add spinach and cook, stirring occasionally, until starting to wilt, about 1 minute. Cover skillet and cook for 1 minute more, allowing condensation to build inside the skillet. Remove from heat, uncover, and stir.",
      "Preheat the oven to 375 degrees F (190 degrees C). Press pie pastry into a 9 1/2-inch deep-dish pie pan. Prick bottom and sides with a fork.",
      "Bake crust in the preheated oven for 10 minutes. Remove from oven and set aside.",
      "Combine eggs, ricotta cheese, cream, Parmigiano Reggiano cheese, basil, salt, and pepper in a blender or food processor. Blend until smooth.",
      "Spread spinach and onion mixture evenly over the crust. Pour egg mixture on top.",
      "Bake in the preheated oven until center of quiche is set and the top is lightly browned, about 40 minutes. Allow to stand for 10 minutes before serving."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 55,
    "totalTimeMinutes": 80,
    "energyContentCalories": 305.8,
    "fatContentGrams": 23.9,
    "carbohydrateContentGrams": 13.9,
    "proteinContentGrams": 9.8,
    "cholesterolContentMilligrams": 142.1,
    "sodiumContentMilligrams": 411.7,
    "ingredients": [
      [
        15.0,
        "butter (mL)"
      ],
      [
        78.8255,
        "finely chopped red onion (mL)"
      ],
      [
        1.0,
        "(8 ounce) package fresh spinach (unit)"
      ],
      [
        0.5,
        "(14 ounce) package pastry for 9-inch double-crust pie (unit)"
      ],
      [
        4.0,
        "large eggs (unit)"
      ],
      [
        177.375,
        "whole-milk ricotta cheese (mL)"
      ],
      [
        177.375,
        "heavy cream (mL)"
      ],
      [
        78.8255,
        "grated parmigiano-reggiano cheese   (mL)"
      ],
      [
        15.0,
        "chopped fresh basil (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        1.25,
        "ground black pepper (mL)"
      ]
    ]
  },
  {
    "name": "Super-Easy Pulled Pork Sandwiches",
    "description": "I use this hearty recipe for my Super Bowl&reg; parties. It's super easy and feeds a lot of hungry football fans. Serve on a large bun with some baked beans, coleslaw, and chips.",
    "recipeInstructions": [
      "Preheat oven to 250 degrees F (120 degrees C).",
      "Mix brown sugar, paprika, garlic powder, black pepper, and salt in a bowl. Spread mustard over pork roast and sprinkle with brown sugar mixture, using the entire amount. Line a shallow baking dish with aluminum foil. Place a rack in the prepared baking dish and arrange pork roast on rack.",
      "Bake in the preheated oven until very tender, 9 to 11 hours. Let pork cool, then shred into bite-size pieces. Stir barbeque sauce into pork to moisten; serve with hamburger buns."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 540,
    "totalTimeMinutes": 555,
    "energyContentCalories": 414.1,
    "fatContentGrams": 11.7,
    "carbohydrateContentGrams": 44.9,
    "proteinContentGrams": 30.0,
    "cholesterolContentMilligrams": 68.2,
    "sodiumContentMilligrams": 865.8,
    "ingredients": [
      [
        45.0,
        "brown sugar (mL)"
      ],
      [
        45.0,
        "paprika (mL)"
      ],
      [
        22.5,
        "garlic powder (such as mccormick® california style) (mL)"
      ],
      [
        22.5,
        "ground black pepper (mL)"
      ],
      [
        7.5,
        "salt (mL)"
      ],
      [
        118.25,
        "dijon mustard (such as hellmann's®) (mL)"
      ],
      [
        3628.0,
        "pork shoulder roast (butt roast), rind removed (g)"
      ],
      [
        118.25,
        "barbeque sauce (mL)"
      ],
      [
        18.0,
        "large hamburger buns, split (unit)"
      ]
    ]
  },
  {
    "name": "Slow Cooker Texas Pulled Pork",
    "description": "Slow cooked, Texas-style pulled pork that is served on a buttered and toasted roll.  My family's favorite.",
    "recipeInstructions": [
      "Pour the vegetable oil into the bottom of a slow cooker. Place the pork roast into the slow cooker; pour in the barbecue sauce, apple cider vinegar, and chicken broth. Stir in the brown sugar, yellow mustard, Worcestershire sauce, chili powder, onion, garlic, and thyme. Cover and cook on High until the roast shreds easily with a fork, 5 to 6 hours.",
      "Remove the roast from the slow cooker, and shred the meat using two forks. Return the shredded pork to the slow cooker, and stir the meat into the juices.",
      "Spread the inside of both halves of hamburger buns with butter. Toast the buns, butter side down, in a skillet over medium heat until golden brown. Spoon pork into the toasted buns."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 300,
    "totalTimeMinutes": 315,
    "energyContentCalories": 527.7,
    "fatContentGrams": 23.2,
    "carbohydrateContentGrams": 45.5,
    "proteinContentGrams": 31.9,
    "cholesterolContentMilligrams": 98.4,
    "sodiumContentMilligrams": 802.7,
    "ingredients": [
      [
        5.0,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "(4 pound) pork shoulder roast  (unit)"
      ],
      [
        236.5,
        "barbeque sauce (mL)"
      ],
      [
        118.25,
        "apple cider vinegar (mL)"
      ],
      [
        118.25,
        "chicken broth (mL)"
      ],
      [
        59.125,
        "light brown sugar (mL)"
      ],
      [
        15.0,
        "prepared yellow mustard (mL)"
      ],
      [
        15.0,
        "worcestershire sauce (mL)"
      ],
      [
        15.0,
        "chili powder (mL)"
      ],
      [
        1.0,
        "extra large onion, chopped (unit)"
      ],
      [
        2.0,
        "large cloves garlic, crushed (unit)"
      ],
      [
        7.5,
        "dried thyme (mL)"
      ],
      [
        8.0,
        "eaches hamburger buns, split (unit)"
      ],
      [
        30.0,
        "butter (mL)"
      ]
    ]
  },
  {
    "name": "The Best Vegetable Salad",
    "description": "This is a refreshing salad using all different kinds of vegetables. You can use whatever you like, but the main things that makes it good are the tomatoes and cucumbers. It is much like an Israeli salad. The homemade dressing is very good on it, but so is just plain olive oil.",
    "recipeInstructions": [
      "Toss together the cucumber, tomato, onion, pepper, radish, jicama, and lettuce in a large salad bowl. Whisk together the garlic, lemon juice, olive oil, pomegranate juice, salt, pepper, dill, basil, and water in a small bowl. Drizzle dressing over the salad just before serving."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 30,
    "energyContentCalories": 87.6,
    "fatContentGrams": 4.8,
    "carbohydrateContentGrams": 10.9,
    "proteinContentGrams": 1.5,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 397.9,
    "ingredients": [
      [
        1.0,
        "cucumber, peeled and chopped (unit)"
      ],
      [
        2.0,
        "tomatoes fresh tomatoes, chopped (unit)"
      ],
      [
        2.0,
        "medium (4-1/8\" long)s green onion, minced (unit)"
      ],
      [
        1.0,
        "red bell pepper, chopped (unit)"
      ],
      [
        5.0,
        "large (1\" to 1-1/4\" dia)s radishes, chopped (unit)"
      ],
      [
        1.0,
        "small jicama, peeled and julienned (unit)"
      ],
      [
        5.0,
        "large leaf (blank)s romaine lettuce leaves, torn into bite size pieces (unit)"
      ],
      [
        1.0,
        "clove garlic, minced (unit)"
      ],
      [
        22.5,
        "lemon juice (mL)"
      ],
      [
        30.0,
        "olive oil (mL)"
      ],
      [
        15.0,
        "pomegranate juice (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        5.0,
        "ground black pepper (mL)"
      ],
      [
        5.0,
        "chopped fresh dill (mL)"
      ],
      [
        5.0,
        "chopped fresh basil (mL)"
      ],
      [
        7.5,
        "water (mL)"
      ]
    ]
  },
  {
    "name": "Old Fashioned Onion Rings",
    "description": "This is an actual recipe from a former employee of a popular drive-in restaurant. Crispy coated onion rings like the pro's make!",
    "recipeInstructions": [
      "Heat the oil in a deep-fryer to 365 degrees F (185 degrees C).",
      "Separate the onion slices into rings, and set aside. In a small bowl, stir together the flour, baking powder and salt.",
      "Dip the onion slices into the flour mixture until they are all coated; set aside. Whisk the egg and milk into the flour mixture using a fork. Dip the floured rings into the batter to coat, then place on a wire rack to drain until the batter stops dripping. The wire rack may be placed over a sheet of aluminum foil for easier clean up. Spread the bread crumbs out on a plate or shallow dish. Place rings one at a time into the crumbs, and scoop the crumbs up over the ring to coat. Give it a hard tap as you remove it from the crumbs. The coating should cling very well. Repeat with remaining rings.",
      "Deep fry the rings a few at a time for 2 to 3 minutes, or until golden brown. Remove to paper towels to drain. Season with seasoning salt, and serve."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 3,
    "totalTimeMinutes": 18,
    "energyContentCalories": 641.2,
    "fatContentGrams": 34.6,
    "carbohydrateContentGrams": 68.3,
    "proteinContentGrams": 14.3,
    "cholesterolContentMilligrams": 68.5,
    "sodiumContentMilligrams": 1271.5,
    "ingredients": [
      [
        1.0,
        "large onion, cut into 1/4-inch slices (unit)"
      ],
      [
        295.625,
        "all-purpose flour (mL)"
      ],
      [
        5.0,
        "baking powder (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        236.5,
        "milk (mL)"
      ],
      [
        177.375,
        "dry bread crumbs (mL)"
      ],
      [
        0.31,
        "seasoned salt (mL)"
      ],
      [
        946.0,
        "oil for frying (mL)"
      ]
    ]
  },
  {
    "name": "Slow Cooker Vanilla Tapioca Pudding",
    "description": "Classic tapioca pudding is made with very little hassle in a slow cooker. There is no need to pre-soak small tapioca pearls prior to cooking. Serve warm or put in individual containers and keep in fridge.",
    "recipeInstructions": [
      "Stir milk, sugar, tapioca, and eggs together in a slow cooker crock.",
      "Cook on Low, stirring once per hour, for 6 hours. Stir vanilla into the pudding."
    ],
    "prepTimeMinutes": 5,
    "cookTimeMinutes": 360,
    "totalTimeMinutes": 365,
    "energyContentCalories": 217.6,
    "fatContentGrams": 6.0,
    "carbohydrateContentGrams": 35.1,
    "proteinContentGrams": 6.3,
    "cholesterolContentMilligrams": 67.1,
    "sodiumContentMilligrams": 75.9,
    "ingredients": [
      [
        0.5,
        "gallon whole milk (unit)"
      ],
      [
        315.3254,
        "sugar (mL)"
      ],
      [
        236.5,
        "small pearl tapioca (mL)"
      ],
      [
        4.0,
        " large eggs eggs, lightly beaten (unit)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ]
    ]
  },
  {
    "name": "Black Pepper Beef and Cabbage Stir Fry",
    "description": "A very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice.",
    "recipeInstructions": [
      "Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.",
      "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 30,
    "energyContentCalories": 280.3,
    "fatContentGrams": 22.1,
    "carbohydrateContentGrams": 9.5,
    "proteinContentGrams": 11.6,
    "cholesterolContentMilligrams": 48.2,
    "sodiumContentMilligrams": 547.3,
    "ingredients": [
      [
        30.0,
        "vegetable oil (mL)"
      ],
      [
        4.0,
        "cloves garlic, chopped (unit)"
      ],
      [
        227.0,
        "ground beef (g)"
      ],
      [
        0.5,
        "small head cabbage, shredded (unit)"
      ],
      [
        1.0,
        "red bell pepper, cut into strips (unit)"
      ],
      [
        30.0,
        "soy sauce (mL)"
      ],
      [
        5.0,
        "cornstarch (mL)"
      ],
      [
        118.25,
        "cold water (mL)"
      ],
      [
        5.0,
        "ground black pepper (mL)"
      ],
      [
        0.31,
        "salt, (mL)"
      ]
    ]
  },
  {
    "name": "Best Strawberry Daiquiri",
    "description": "A frosty blender full of strawberry-citrus slush. You will enjoy this with or without the rum!",
    "recipeInstructions": [
      "In a blender, combine ice, sugar and strawberries. Pour in lime juice, lemon juice, rum and lemon-lime soda. Blend until smooth. Pour into glasses and serve."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 10,
    "energyContentCalories": 109.5,
    "fatContentGrams": 0.0,
    "carbohydrateContentGrams": 16.3,
    "proteinContentGrams": 0.1,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 6.5,
    "ingredients": [
      [
        1419.0,
        "ice (mL)"
      ],
      [
        118.25,
        "sugar (mL)"
      ],
      [
        4.0,
        "ounces frozen strawberries (unit)"
      ],
      [
        29.5625,
        "lime juice (mL)"
      ],
      [
        118.25,
        "lemon juice (mL)"
      ],
      [
        177.375,
        "rum (mL)"
      ],
      [
        59.125,
        "lemon-lime flavored carbonated beverage (mL)"
      ]
    ]
  },
  {
    "name": "Chap Chee Noodles",
    "description": "A Korean-style noodle dish made with meat and vegetables.",
    "recipeInstructions": [
      "In a large bowl, combine 1 tablespoon soy sauce, sesame oil, green onions, garlic, sesame seeds, 1 teaspoon sugar, and 1/4 teaspoon pepper. Stir in sliced beef, and marinate at room temperature for 15 minutes.",
      "Heat wok or large skillet over medium-high heat, then drizzle with oil. Cook beef until evenly brown. Stir in carrots, bamboo shoots, napa cabbage, and spinach. Add cellophane noodles, 2 tablespoons soy sauce, 1 tablespoon sugar, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Reduce heat to medium, and cook until heated through."
    ],
    "prepTimeMinutes": 35,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 55,
    "energyContentCalories": 259.6,
    "fatContentGrams": 12.5,
    "carbohydrateContentGrams": 26.8,
    "proteinContentGrams": 10.6,
    "cholesterolContentMilligrams": 23.1,
    "sodiumContentMilligrams": 1024.5,
    "ingredients": [
      [
        15.0,
        "soy sauce (mL)"
      ],
      [
        15.0,
        "sesame oil (mL)"
      ],
      [
        2.0,
        "medium (4-1/8\" long)s green onions, finely chopped (unit)"
      ],
      [
        1.0,
        "clove garlic, minced (unit)"
      ],
      [
        5.0,
        "sesame seeds (mL)"
      ],
      [
        5.0,
        "sugar (mL)"
      ],
      [
        1.25,
        "black pepper (mL)"
      ],
      [
        151.0,
        "beef top sirloin, thinly sliced (g)"
      ],
      [
        30.0,
        "vegetable oil (mL)"
      ],
      [
        118.25,
        "thinly sliced carrots (mL)"
      ],
      [
        118.25,
        "sliced bamboo shoots, drained (mL)"
      ],
      [
        113.0,
        "napa cabbage, sliced (g)"
      ],
      [
        473.0,
        "chopped fresh spinach (mL)"
      ],
      [
        3.0,
        "ounces cellophane noodles, soaked in warm water (unit)"
      ],
      [
        30.0,
        "soy sauce (mL)"
      ],
      [
        15.0,
        "sugar (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        1.25,
        "black pepper (mL)"
      ]
    ]
  },
  {
    "name": "Chewy Peanut Butter Chocolate Chip Cookies",
    "description": "These cookies are really chewy and addictive.",
    "recipeInstructions": [
      "Preheat oven to 375 degrees F (190 degrees C).",
      "In a large bowl, cream together the butter, peanut butter, brown sugar, and white sugar until smooth. Beat in the eggs one at a time, then stir in the corn syrup, water, and vanilla. Combine the flour, baking soda, and salt; stir into the peanut butter mixture. Fold in chocolate chunks. Drop by 1/4 cupfuls 3 inches apart onto ungreased baking sheets.",
      "Bake for 12 to 14 minutes in the preheated oven, or until edges are golden. Allow cookies to cool for 1 minute on the cookie sheet before removing to wire racks to cool completely."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 60,
    "energyContentCalories": 245.7,
    "fatContentGrams": 11.6,
    "carbohydrateContentGrams": 33.5,
    "proteinContentGrams": 4.3,
    "cholesterolContentMilligrams": 25.7,
    "sodiumContentMilligrams": 162.6,
    "ingredients": [
      [
        118.25,
        "butter, softened (mL)"
      ],
      [
        118.25,
        "peanut butter (mL)"
      ],
      [
        236.5,
        "brown sugar (mL)"
      ],
      [
        118.25,
        "sugar (mL)"
      ],
      [
        2.0,
        "egg (unit)"
      ],
      [
        30.0,
        "light corn syrup (mL)"
      ],
      [
        30.0,
        "water (mL)"
      ],
      [
        10.0,
        "vanilla extract (mL)"
      ],
      [
        591.25,
        "all-purpose flour (mL)"
      ],
      [
        5.0,
        "baking soda (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        473.0,
        "chopped semisweet chocolate (mL)"
      ]
    ]
  },
  {
    "name": "Home-Style Vegetable Beef Soup",
    "description": "This hearty soup is great on a cold winter day.  Serve with homemade cornbread, biscuits, or crackers.",
    "recipeInstructions": [
      "In a large pot over medium heat, cook beef, onion and potatoes, covered, until beef is no longer pink and potatoes are tender, 10 to 15 minutes.",
      "Meanwhile, place carrots and 1/2 cup water in a microwave safe bowl and microwave on high 5 minutes, until tender.",
      "Drain beef mixture and return to pot with carrots, corn, green beans, juice cocktail, water, salt and pepper.  Simmer over low heat 30 minutes, until flavors are well blended and soup is hot."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 45,
    "totalTimeMinutes": 55,
    "energyContentCalories": 268.4,
    "fatContentGrams": 6.9,
    "carbohydrateContentGrams": 39.2,
    "proteinContentGrams": 13.3,
    "cholesterolContentMilligrams": 27.5,
    "sodiumContentMilligrams": 756.3,
    "ingredients": [
      [
        454.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "onion, diced (unit)"
      ],
      [
        6.0,
        "medium (blank)s red potatoes, finely diced (unit)"
      ],
      [
        5.0,
        "medium (blank)s carrots, thinly sliced (unit)"
      ],
      [
        118.25,
        "water (mL)"
      ],
      [
        1.0,
        "(15 ounce) can whole kernel corn, drained (unit)"
      ],
      [
        473.0,
        "frozen green beans (mL)"
      ],
      [
        1.0,
        "(46 fluid ounce) bottle tomato-vegetable juice cocktail (unit)"
      ],
      [
        236.5,
        "water (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        5.0,
        "ground black pepper (mL)"
      ]
    ]
  },
  {
    "name": "Greek Orzo Salad",
    "description": "A delicious, colorful salad, with artichoke hearts and feta.  I receive a lot of requests for this one.",
    "recipeInstructions": [
      "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.  Drain artichoke hearts, reserving liquid.",
      "In large bowl combine pasta, artichoke hearts, tomato, cucumber, onion, feta, olives, parsley, lemon juice, oregano and lemon pepper.  Toss and chill for 1 hour in refrigerator.",
      "Just before serving, drizzle reserved artichoke marinade over salad."
    ],
    "prepTimeMinutes": 70,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 80,
    "energyContentCalories": 325.8,
    "fatContentGrams": 10.2,
    "carbohydrateContentGrams": 48.7,
    "proteinContentGrams": 13.1,
    "cholesterolContentMilligrams": 22.3,
    "sodiumContentMilligrams": 615.2,
    "ingredients": [
      [
        354.75,
        "uncooked orzo pasta (mL)"
      ],
      [
        2.0,
        "(6 ounce) cans marinated artichoke hearts (unit)"
      ],
      [
        1.0,
        "tomato, seeded and chopped (unit)"
      ],
      [
        1.0,
        "cucumber, seeded and chopped (unit)"
      ],
      [
        1.0,
        "red onion, chopped (unit)"
      ],
      [
        236.5,
        "crumbled feta cheese (mL)"
      ],
      [
        1.0,
        "(2 ounce) can black olives, drained (unit)"
      ],
      [
        59.125,
        "chopped fresh parsley (mL)"
      ],
      [
        15.0,
        "lemon juice (mL)"
      ],
      [
        2.5,
        "dried oregano (mL)"
      ],
      [
        2.5,
        "lemon pepper (mL)"
      ]
    ]
  },
  {
    "name": "Vietnamese Sandwich",
    "description": "While teaching English in Asia the past several years, I've been lucky to exchange some delicious and authentic recipes with local people. This Vietnamese banh mi sandwich is awesome, and it is a nice break from common sandwiches. The garlic chili sauce is common in Asian sections of markets but Indonesian sambal or Korean chili paste can also be substituted. Beer or red wine is the beverage of choice for this authentic recipe of French-influenced  Vietnamese cuisine.",
    "recipeInstructions": [
      "Preheat the oven's broiler. Place the pork chops on a broiling pan and set under the broiler. Cook for about 5 minutes, turning once, or until browned on each side.",
      "Open the French rolls and spread mayonnaise on the insides. Place one of the cooked pork chops into each roll. Spread chile sauce directly on the meat. Sprinkle with a little lime juice and top with slices of onion, cucumber, cilantro, salt and pepper. Finish with another quick drizzle of lime juice."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 15,
    "energyContentCalories": 626.7,
    "fatContentGrams": 12.1,
    "carbohydrateContentGrams": 72.1,
    "proteinContentGrams": 55.3,
    "cholesterolContentMilligrams": 123.8,
    "sodiumContentMilligrams": 908.1,
    "ingredients": [
      [
        4.0,
        "raw chop with refuse, 195 g; yields excluding refuses boneless pork loin chops, cut 1/4 inch thick (unit)"
      ],
      [
        4.0,
        "(7 inch) french bread baguettes, split lengthwise (unit)"
      ],
      [
        20.0,
        "mayonnaise (mL)"
      ],
      [
        1.0,
        "ounce chile sauce with garlic (unit)"
      ],
      [
        59.125,
        "fresh lime juice (mL)"
      ],
      [
        1.0,
        "small red onion, sliced into rings (unit)"
      ],
      [
        1.0,
        "medium cucumber, peeled and sliced lengthwise (unit)"
      ],
      [
        30.0,
        "chopped fresh cilantro (mL)"
      ],
      [
        0.31,
        "salt and pepper (mL)"
      ]
    ]
  },
  {
    "name": "Korean Take-Out Rice Noodles (Vegan)",
    "description": "Here is a vegan Korean rice noodle recipe that I got from a Korean friend of mine when I was stationed there. It's super simple to make, vegan, and low cost. This can be made into a main dish by adding meat if you like. Garnish with cilantro and douse with some sriracha, if desired.",
    "recipeInstructions": [
      "Pulse ginger, garlic, and sugar together in a food processor or blender. Add water, tamari, almond butter, 2 tablespoons sesame oil, Worcestershire sauce, rice vinegar, and red pepper flakes. Process again until smooth. Transfer sauce to a small bowl. Cover with plastic wrap and refrigerate until flavors intensify, at least 1 hour.",
      "Bring a large pot of lightly salted water to a boil. Cook noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, about 14 minutes. Toss in bok choy; cook until slightly wilted, about 1 minute. Drain and rinse in cold water to chill the noodles. Toss in a bowl with remaining 1 tablespoon sesame oil.",
      "Heat a skillet over medium heat. Add carrots; cook and stir until slightly tender, about 3 minutes. Add zucchini. Cook until tender but not mushy, about 5 minutes.",
      "Mix the chilled sauce into the bowl of noodles. Add the carrots and zucchini mixture, scallions, and sesame seeds."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 95,
    "energyContentCalories": 530.0,
    "fatContentGrams": 21.4,
    "carbohydrateContentGrams": 78.5,
    "proteinContentGrams": 9.7,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 1327.3,
    "ingredients": [
      [
        15.0,
        "diced ginger root (mL)"
      ],
      [
        1.0,
        "clove garlic, chopped (unit)"
      ],
      [
        59.125,
        "palm sugar (mL)"
      ],
      [
        78.8255,
        "water (mL)"
      ],
      [
        59.125,
        "tamari (mL)"
      ],
      [
        59.125,
        "almond butter (mL)"
      ],
      [
        45.0,
        "sesame oil (mL)"
      ],
      [
        30.0,
        "vegan worcestershire sauce (such as annie's®) (mL)"
      ],
      [
        15.0,
        "rice vinegar (mL)"
      ],
      [
        2.5,
        "red pepper flakes (mL)"
      ],
      [
        1.0,
        "(8 ounce) package spaghetti-style rice noodles (such as tinkyada®) (unit)"
      ],
      [
        2.0,
        "small heads baby bok choy, trimmed and chopped (unit)"
      ],
      [
        2.0,
        "large carrots, peeled and cut into matchsticks (unit)"
      ],
      [
        1.0,
        "large zucchini - peeled, seeded, and cut into matchsticks (unit)"
      ],
      [
        1.0,
        "bunch scallions, chopped (unit)"
      ],
      [
        15.0,
        "toasted sesame seeds (mL)"
      ]
    ]
  },
  {
    "name": "Hasselback Potatoes",
    "description": "This Swedish dish takes its name from Hasselbacken, the Stockholm restaurant where it was first served. The seasoned potatoes turn out crisp on the outside and tender on the inside.",
    "recipeInstructions": [
      "Preheat the oven to 425 degrees F (220 degrees C).",
      "Peel the potatoes, and place in bowl of cold water to prevent browning. Place potatoes into a large wooden or metal spoon. Using a sharp knife, make slices across the potato the short way about 1/8 to 1/4 inch apart, making sure to cut down to the lip of the spoon, not all the way through the potato. The slices should stay connected at the bottom, and the spoon helps keep the depth even. Return the potato to the bowl of water, and proceed with the remaining potatoes.",
      "When all of the potatoes are cut, place them cut side up in a shallow baking dish or small roasting pan. Drizzle with half of the butter, then season with salt and pepper.",
      "Bake for 35 to 40 minutes in the preheated oven. Remove from the oven, and drizzle with the remaining butter. Sprinkle Romano cheese and bread crumbs onto the tops of the potatoes, and season with a little more salt and pepper. Return to the oven, and bake for an additional 20 minutes, or until nicely browned."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 55,
    "totalTimeMinutes": 75,
    "energyContentCalories": 247.3,
    "fatContentGrams": 7.1,
    "carbohydrateContentGrams": 41.1,
    "proteinContentGrams": 6.1,
    "cholesterolContentMilligrams": 19.2,
    "sodiumContentMilligrams": 171.2,
    "ingredients": [
      [
        4.0,
        "(8 ounce) baking potatoes (unit)"
      ],
      [
        30.0,
        "butter, melted (mL)"
      ],
      [
        0.31,
        "salt and pepper (mL)"
      ],
      [
        30.0,
        "finely grated fresh romano cheese (mL)"
      ],
      [
        15.0,
        "seasoned dry bread crumbs (mL)"
      ]
    ]
  },
  {
    "name": "Gramma's Old Fashioned Chili Mac",
    "description": "This is an old family recipe that my mom has cooked for 50 years. It's a  wonderful, 'stick-to-the-ribs' meal that goes wonderful with warm cornbread or rolls. I find that kids love this when they don't like regular 'spicy' chili. Enjoy!",
    "recipeInstructions": [
      "Bring a pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.",
      "In a small saucepan, simmer celery and green pepper with water to cover until tender; Drain.",
      "Place ground beef in a large heavy skillet over medium heat. Cook until evenly brown. Add onion, and cook until tender and translucent. Drain excess fat. Add celery and green pepper. Stir in kidney beans, condensed tomato soup, diced tomatoes and brown sugar. Season with salt and pepper, and stir in macaroni."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 25,
    "totalTimeMinutes": 40,
    "energyContentCalories": 489.0,
    "fatContentGrams": 22.4,
    "carbohydrateContentGrams": 49.2,
    "proteinContentGrams": 22.1,
    "cholesterolContentMilligrams": 64.3,
    "sodiumContentMilligrams": 996.8,
    "ingredients": [
      [
        236.5,
        "elbow macaroni (mL)"
      ],
      [
        454.0,
        "ground beef (g)"
      ],
      [
        1.0,
        "small onion, chopped (unit)"
      ],
      [
        236.5,
        "chopped celery (mL)"
      ],
      [
        0.5,
        "large green bell pepper, chopped (unit)"
      ],
      [
        1.0,
        "(15 ounce) can kidney beans, drained (unit)"
      ],
      [
        2.0,
        "(10.75 ounce) cans  condensed tomato soup (unit)"
      ],
      [
        2.0,
        "(14.5 ounce) cans diced tomatoes (unit)"
      ],
      [
        29.5625,
        "brown sugar (mL)"
      ],
      [
        1.0,
        "salt and pepper (unit)"
      ]
    ]
  },
  {
    "name": "Banana Pudding IV",
    "description": "A quick and easy banana pudding recipe - enjoy!",
    "recipeInstructions": [
      "In a large bowl, beat cream cheese until fluffy.  Beat in condensed milk, pudding mix, cold milk and vanilla until smooth.  Fold in 1/2 of the whipped topping.",
      "Line the bottom of a 9x13 inch dish with vanilla wafers. Arrange sliced bananas evenly over wafers. Spread with pudding mixture. Top with remaining whipped topping. Chill."
    ],
    "prepTimeMinutes": 30,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 210,
    "energyContentCalories": 387.9,
    "fatContentGrams": 15.4,
    "carbohydrateContentGrams": 55.3,
    "proteinContentGrams": 7.1,
    "cholesterolContentMilligrams": 32.9,
    "sodiumContentMilligrams": 333.8,
    "ingredients": [
      [
        1.0,
        "(8 ounce) package cream cheese, at room temperature   (unit)"
      ],
      [
        1.0,
        "(14 ounce) can sweetened condensed milk (unit)"
      ],
      [
        1.0,
        "(5 ounce) package instant vanilla pudding mix (unit)"
      ],
      [
        709.5,
        "cold skim milk (mL)"
      ],
      [
        5.0,
        "vanilla extract (mL)"
      ],
      [
        1.0,
        "(8 ounce) container frozen whipped topping, thawed (unit)"
      ],
      [
        4.0,
        "medium (7\" to 7-7/8\" long)s bananas, sliced (unit)"
      ],
      [
        0.5,
        "(12 ounce) package vanilla wafers (unit)"
      ]
    ]
  },
  {
    "name": "Old Fashioned Potato Cakes",
    "description": "These potato cakes are great with any meal or as a snack. Simple and quick to make with only a few ingredients. Kids of ALL ages love 'em.",
    "recipeInstructions": [
      "Mix mashed potatoes, flour, onion, egg, black pepper, and salt together in a bowl until batter consistency.",
      "Heat vegetable oil in a skillet over medium heat. Drop 4-inch circles of batter into hot oil. Cook until golden brown, about 5 minutes per side. Remove with a slotted spoon and drain on paper towels. Repeat with remaining batter."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 10,
    "totalTimeMinutes": 20,
    "energyContentCalories": 254.8,
    "fatContentGrams": 4.9,
    "carbohydrateContentGrams": 45.1,
    "proteinContentGrams": 7.1,
    "cholesterolContentMilligrams": 48.6,
    "sodiumContentMilligrams": 627.1,
    "ingredients": [
      [
        473.0,
        "mashed potatoes (mL)"
      ],
      [
        236.5,
        "all-purpose flour (mL)"
      ],
      [
        1.0,
        "onion, diced (unit)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        118.25,
        "vegetable oil (mL)"
      ]
    ]
  },
  {
    "name": "Chocolate Crinkles II",
    "description": "Chocolate cookies coated in confectioners' sugar...very good!",
    "recipeInstructions": [
      "In a medium bowl, mix together cocoa, white sugar, and vegetable oil.  Beat in eggs one at a time, then stir in the vanilla. Combine the flour, baking powder, and salt; stir into the cocoa mixture. Cover dough, and chill for at least 4 hours.",
      "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper. Roll dough into one inch balls. I like to use a number 50 size scoop. Coat each ball in confectioners' sugar before placing onto prepared cookie sheets.",
      "Bake in preheated oven for 10 to 12 minutes. Let stand on the cookie sheet for a minute before transferring to wire racks to cool."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 12,
    "totalTimeMinutes": 300,
    "energyContentCalories": 58.0,
    "fatContentGrams": 2.0,
    "carbohydrateContentGrams": 9.8,
    "proteinContentGrams": 0.9,
    "cholesterolContentMilligrams": 10.3,
    "sodiumContentMilligrams": 33.9,
    "ingredients": [
      [
        236.5,
        "cocoa powder (mL)"
      ],
      [
        473.0,
        "sugar (mL)"
      ],
      [
        118.25,
        "vegetable oil (mL)"
      ],
      [
        4.0,
        "egg (unit)"
      ],
      [
        10.0,
        "vanilla extract (mL)"
      ],
      [
        473.0,
        "all-purpose flour (mL)"
      ],
      [
        10.0,
        "baking powder (mL)"
      ],
      [
        2.5,
        "salt (mL)"
      ],
      [
        118.25,
        "powdered sugar (mL)"
      ]
    ]
  },
  {
    "name": "Calico Beans",
    "description": "This casserole is the best! I take it to pot lucks, picnics, camping trips, etc.",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 C).",
      "Place bacon and ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Drain and set aside.",
      "In a four quart casserole dish, mix together the bacon, ground beef, pork and beans, kidney beans, butter beans, lima beans, ketchup, onion, vinegar, dry mustard and celery.",
      "Cover and bake for 1 hour."
    ],
    "prepTimeMinutes": 10,
    "cookTimeMinutes": 75,
    "totalTimeMinutes": 85,
    "energyContentCalories": 434.5,
    "fatContentGrams": 10.0,
    "carbohydrateContentGrams": 66.6,
    "proteinContentGrams": 22.3,
    "cholesterolContentMilligrams": 38.2,
    "sodiumContentMilligrams": 952.9,
    "ingredients": [
      [
        118.25,
        "bacon, chopped (mL)"
      ],
      [
        454.0,
        "lean ground beef (g)"
      ],
      [
        1.0,
        "(15 ounce) can pork and beans (unit)"
      ],
      [
        1.0,
        "(15 ounce) can kidney beans, drained (unit)"
      ],
      [
        1.0,
        "(15 ounce) can butter beans (unit)"
      ],
      [
        1.0,
        "(15 ounce) can lima beans, drained (unit)"
      ],
      [
        118.25,
        "ketchup (mL)"
      ],
      [
        236.5,
        "brown sugar (mL)"
      ],
      [
        236.5,
        "chopped onion (mL)"
      ],
      [
        45.0,
        "white wine vinegar (mL)"
      ],
      [
        5.0,
        "mustard powder (mL)"
      ],
      [
        118.25,
        "chopped celery (mL)"
      ]
    ]
  },
  {
    "name": "Instant Pot® Baked Beans",
    "description": "This recipe was passed down through my French Canadian family from my grandmother, to my mother and then to me many years ago. It traditionally takes hours to make, as we let the beans slow cook overnight in the oven on low heat. I decided to try and transform it into a much quicker Instant Pot® recipe with great success! With this method, you don't even have to presoak the beans. These are even better the next day, and they freeze well, too.",
    "recipeInstructions": [
      "Combine water and beans in a multi-functional pressure cooker (such as an Instant Pot&reg;). Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Release pressure using the natural-release method for 20 minutes; quick-release remaining pressure according to manufacturer's directions. Unlock and remove the lid. Drain and rinse the beans with cold water and set aside.  Rinse and wipe out Instant Pot&reg; insert and place back into the pressure cooker.",
      "Turn on Instant Pot&reg; and select Saute function. Heat olive oil until shimmering, 2 to 3 minutes. Add salt pork, bacon, and onion and briefly cook until fat begins to render, 1 to 2 minutes.  Pour in 1/2 cup water and scrape any brown bits off the bottom. Turn Instant Pot&reg; off.",
      "Whisk together ketchup, molasses, brown sugar, mustard, and remaining 1 cup water in a small bowl. Return cooked beans to the pot along with the ketchup mixture. Gently stir to combine. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 35 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Release pressure using the natural-release method for 20 minutes; quick-release any remaining pressure according to manufacturer's directions. Unlock and remove the lid. Beans will thicken upon cooling. Serve immediately or freeze portions for later."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 75,
    "totalTimeMinutes": 130,
    "energyContentCalories": 320.6,
    "fatContentGrams": 15.1,
    "carbohydrateContentGrams": 36.2,
    "proteinContentGrams": 11.1,
    "cholesterolContentMilligrams": 17.3,
    "sodiumContentMilligrams": 392.4,
    "ingredients": [
      [
        1892.0,
        "water (mL)"
      ],
      [
        454.0,
        "dry navy beans, rinsed and picked through (g)"
      ],
      [
        15.0,
        "olive oil (mL)"
      ],
      [
        6.0,
        "ounces salt pork, diced (unit)"
      ],
      [
        6.0,
        "ounces bacon, cut into small pieces (unit)"
      ],
      [
        1.0,
        "small onion, minced (unit)"
      ],
      [
        354.75,
        "water (mL)"
      ],
      [
        59.125,
        "ketchup (mL)"
      ],
      [
        78.8255,
        "molasses (mL)"
      ],
      [
        59.125,
        "brown sugar (mL)"
      ],
      [
        15.0,
        "yellow mustard (mL)"
      ]
    ]
  },
  {
    "name": "Authentic Pho",
    "description": "This authentic pho isn't quick, but it is delicious. The key is in the broth, which gets simmered for at least 6 hours.",
    "recipeInstructions": [
      "Preheat oven to 425 degrees F (220 degrees C).",
      "Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour.",
      "Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes.",
      "Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside.",
      "Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer.",
      "Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 480,
    "totalTimeMinutes": 560,
    "energyContentCalories": 508.6,
    "fatContentGrams": 11.0,
    "carbohydrateContentGrams": 65.6,
    "proteinContentGrams": 34.9,
    "cholesterolContentMilligrams": 74.0,
    "sodiumContentMilligrams": 3519.3,
    "ingredients": [
      [
        1814.0,
        "beef soup bones (g)"
      ],
      [
        1.0,
        "onion, unpeeled and cut in half (unit)"
      ],
      [
        5.0,
        "slices fresh ginger (unit)"
      ],
      [
        15.0,
        "salt (mL)"
      ],
      [
        2.0,
        "pods star anise (unit)"
      ],
      [
        37.5,
        "fish sauce (mL)"
      ],
      [
        3784.0,
        "water (mL)"
      ],
      [
        1.0,
        "(8 ounce) package dried rice noodles (unit)"
      ],
      [
        680.0,
        "beef top sirloin, thinly sliced (g)"
      ],
      [
        118.25,
        "chopped cilantro (mL)"
      ],
      [
        15.0,
        "chopped green onion (mL)"
      ],
      [
        354.75,
        "bean sprouts (mL)"
      ],
      [
        1.0,
        "bunch thai basil (unit)"
      ],
      [
        1.0,
        "lime, cut into 4 wedges (unit)"
      ],
      [
        59.125,
        "hoisin sauce (mL)"
      ],
      [
        59.125,
        "chile-garlic sauce (such as sriracha®) (mL)"
      ]
    ]
  },
  {
    "name": "Taco Casserole",
    "description": "We love Mexican food and I love easy meals, this fits both. Serve with a salad and it's a meal!",
    "recipeInstructions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "Cook pasta in a large pot of boiling water until al dente.  Drain.",
      "In a large skillet, cook and stir ground beef and chopped onion over medium heat until brown.  Mix in tomato soup, diced tomatoes, and taco seasoning mix.   Stir in pasta.",
      "Spoon beef mixture into a 9x13 inch baking dish.  Sprinkle crumbled taco chips and grated cheese on top.",
      "Bake for 30 to 35 minutes, until the cheese is melted.  Serve with chopped green onions and sour cream, if desired."
    ],
    "prepTimeMinutes": 25,
    "cookTimeMinutes": 35,
    "totalTimeMinutes": 60,
    "energyContentCalories": 334.3,
    "fatContentGrams": 17.0,
    "carbohydrateContentGrams": 28.2,
    "proteinContentGrams": 15.6,
    "cholesterolContentMilligrams": 50.1,
    "sodiumContentMilligrams": 634.6,
    "ingredients": [
      [
        454.0,
        "lean ground beef (g)"
      ],
      [
        8.0,
        "ounces macaroni (unit)"
      ],
      [
        118.25,
        "chopped onion (mL)"
      ],
      [
        1.0,
        "(10.75 ounce) can  condensed tomato soup (unit)"
      ],
      [
        1.0,
        "(14.5 ounce) can diced tomatoes (unit)"
      ],
      [
        1.0,
        "(1.25 ounce) package taco seasoning mix (unit)"
      ],
      [
        2.0,
        "ounces shredded cheddar cheese (unit)"
      ],
      [
        2.0,
        "ounces shredded monterey jack cheese (unit)"
      ],
      [
        236.5,
        "crushed tortilla chips (mL)"
      ],
      [
        118.25,
        "sour cream (mL)"
      ],
      [
        59.125,
        "chopped green onions (mL)"
      ]
    ]
  },
  {
    "name": "Onigiri - Japanese Rice Balls",
    "description": "Onigiri are Japanese rice balls. They're fun to make and are a staple of Japanese lunchboxes (bento). You can put almost anything in an onigiri; try substituting grilled salmon, pickled plums, beef, pork, turkey, or tuna with mayonnaise.",
    "recipeInstructions": [
      "Wash the rice in a mesh strainer until the water runs clear. Combine washed rice and 4 1/2 cups water in a saucepan. Bring to a boil over high heat, stirring occasionally. Reduce heat to low; cover.  Simmer rice until the water is absorbed, 15 to 20 minutes.  Let rice rest, for 15 minutes to allow the rice to continue to steam and become tender. Allow cooked rice to cool.",
      "Combine 1 cup water with the salt in a small bowl.  Use this water to dampen hands before handling the rice. Divide the cooked rice into 8 equal portions. Use one portion of rice for each onigiri.",
      "Divide one portion of rice in two. Create a dimple in the rice and fill with a heaping teaspoon of bonito flakes. Cover with the remaining portion of rice and press lightly to enclose filling inside rice ball.  Gently press the rice to shape into a triangle. Wrap shaped onigiri with a strip of nori. Sprinkle with sesame seeds. Repeat to make a total of 8 onigiri."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 30,
    "totalTimeMinutes": 70,
    "energyContentCalories": 744.4,
    "fatContentGrams": 3.3,
    "carbohydrateContentGrams": 159.4,
    "proteinContentGrams": 14.4,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 160.4,
    "ingredients": [
      [
        946.0,
        "uncooked short-grain white rice (mL)"
      ],
      [
        1064.25,
        "water (mL)"
      ],
      [
        236.5,
        "water (mL)"
      ],
      [
        1.25,
        "salt (mL)"
      ],
      [
        59.125,
        "bonito shavings (dry fish flakes) (mL)"
      ],
      [
        2.0,
        "sheets nori (dry seaweed), cut into 1/2-inch strips (unit)"
      ],
      [
        30.0,
        "sesame seeds (mL)"
      ]
    ]
  },
  {
    "name": "Grilled Cheese Sandwich",
    "description": "Bread, butter and Cheddar cheese - here's a way to make this classic sandwich in a nonstick pan.",
    "recipeInstructions": [
      "Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese."
    ],
    "prepTimeMinutes": 5,
    "cookTimeMinutes": 15,
    "totalTimeMinutes": 20,
    "energyContentCalories": 400.0,
    "fatContentGrams": 28.3,
    "carbohydrateContentGrams": 25.7,
    "proteinContentGrams": 11.1,
    "cholesterolContentMilligrams": 75.6,
    "sodiumContentMilligrams": 639.2,
    "ingredients": [
      [
        4.0,
        "slices white bread (unit)"
      ],
      [
        45.0,
        "butter (mL)"
      ],
      [
        2.0,
        "slices cheddar cheese (unit)"
      ]
    ]
  },
  {
    "name": "Fruit Leather",
    "description": "Make your own fruit leather out of apples and pears, and enjoy it as a snack any time.",
    "recipeInstructions": [
      "Preheat the oven to 150 degrees F (65 degrees C). Cover a baking sheet with a layer of plastic wrap or parchment paper.",
      "In the container of a blender, combine the sugar, lemon juice, apple and pear. Cover and puree until smooth. Spread evenly on the prepared pan. Place the pan on the top rack of the oven.",
      "Bake for 5 to 6 hours, leaving the door to the oven partway open. Fruit is dry when the surface is no longer tacky and you can tear it like leather. Roll up on the plastic wrap and store in an airtight jar."
    ],
    "prepTimeMinutes": 20,
    "cookTimeMinutes": 300,
    "totalTimeMinutes": 320,
    "energyContentCalories": 89.5,
    "fatContentGrams": 0.1,
    "carbohydrateContentGrams": 23.5,
    "proteinContentGrams": 0.3,
    "cholesterolContentMilligrams": 0.0,
    "sodiumContentMilligrams": 0.8,
    "ingredients": [
      [
        236.5,
        "sugar (mL)"
      ],
      [
        59.125,
        "lemon juice (mL)"
      ],
      [
        946.0,
        "peeled, cored and chopped apple (mL)"
      ],
      [
        946.0,
        "peeled, cored and chopped pears (mL)"
      ]
    ]
  },
  {
    "name": "Gyoza",
    "description": "I learned this recipe for pot stickers while living in Japan. They're great hot or cold, and may be eaten plain or with the dipping sauce. Any ground meat can be substituted for pork.",
    "recipeInstructions": [
      "Heat sesame oil in a large skillet over medium high heat. Mix in cabbage, onion, garlic and carrot. Cook and stir until cabbage is limp. Mix in ground pork and egg. Cook until pork is evenly brown and egg is no longer runny.",
      "Preheat vegetable oil in a large skillet over medium high heat.",
      "Place approximately 1 tablespoon of the cabbage and pork mixture in the center of each wrapper. Fold wrappers in half over filling, and seal edges with moistened fingers.",
      "In the preheated vegetable oil, cook gyoza approximately 1 minute per side, until lightly browned. Place water into skillet and reduce heat. Cover and allow gyoza to steam until the water is gone.",
      "In a small bowl, mix soy sauce and rice vinegar. Use the mixture as a dipping sauce for the finished wrappers."
    ],
    "prepTimeMinutes": 40,
    "cookTimeMinutes": 5,
    "totalTimeMinutes": 45,
    "energyContentCalories": 183.6,
    "fatContentGrams": 8.5,
    "carbohydrateContentGrams": 18.5,
    "proteinContentGrams": 7.9,
    "cholesterolContentMilligrams": 37.5,
    "sodiumContentMilligrams": 546.3,
    "ingredients": [
      [
        15.0,
        "sesame oil (mL)"
      ],
      [
        473.0,
        "chopped cabbage (mL)"
      ],
      [
        59.125,
        "chopped onion (mL)"
      ],
      [
        1.0,
        "clove garlic, chopped (unit)"
      ],
      [
        59.125,
        "chopped carrot (mL)"
      ],
      [
        227.0,
        "ground pork (g)"
      ],
      [
        1.0,
        "egg (unit)"
      ],
      [
        15.0,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "(10 ounce) package wonton wrappers (unit)"
      ],
      [
        59.125,
        "water (mL)"
      ],
      [
        59.125,
        "soy sauce (mL)"
      ],
      [
        30.0,
        "rice vinegar (mL)"
      ]
    ]
  },
  {
    "name": "Best Tuna Casserole",
    "description": "This is a tuna casserole that even my picky family loves! The potato chips give the casserole a crunchy crust.",
    "recipeInstructions": [
      "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain.",
      "Preheat oven to 425 degrees F (220 degrees C).",
      "In a large bowl, thoroughly mix noodles, onion, 1 cup cheese, peas, tuna, soup and mushrooms. Transfer to a 9x13 inch baking dish, and top with potato chip crumbs and remaining 1 cup cheese.",
      "Bake for 15 to 20 minutes in the preheated oven, or until cheese is bubbly."
    ],
    "prepTimeMinutes": 15,
    "cookTimeMinutes": 20,
    "totalTimeMinutes": 35,
    "energyContentCalories": 595.0,
    "fatContentGrams": 26.1,
    "carbohydrateContentGrams": 58.1,
    "proteinContentGrams": 32.1,
    "cholesterolContentMilligrams": 99.2,
    "sodiumContentMilligrams": 1061.1,
    "ingredients": [
      [
        1.0,
        "(12 ounce) package egg noodles (unit)"
      ],
      [
        59.125,
        "chopped onion (mL)"
      ],
      [
        473.0,
        "shredded cheddar cheese (mL)"
      ],
      [
        236.5,
        "frozen green peas (mL)"
      ],
      [
        2.0,
        "(5 ounce) cans tuna, drained (unit)"
      ],
      [
        2.0,
        "(10.75 ounce) cans  condensed cream of mushroom soup (unit)"
      ],
      [
        0.5,
        "(4.5 ounce) can sliced mushrooms (unit)"
      ],
      [
        236.5,
        "crushed potato chips (mL)"
      ]
    ]
  },
  {
    "name": "Chicken Biryani",
    "description": "This is a delicious Pakistani/Indian rice dish which is often reserved for very special occasions such as weddings, parties, or holidays such as Ramadan. It has a lengthy preparation, but the work is definitely worth it. For biryani, always use long grain rice. Basmati rice with its thin, fine grains is  the ideal variety to use. Ghee is butter that has been slowly melted so that the milk solids and golden liquid have been separated and can be used in place of vegetable oil to yield a more authentic taste.",
    "recipeInstructions": [
      "In a large skillet, in 2 tablespoons vegetable oil (or ghee) fry potatoes until brown, drain and reserve the potatoes. Add remaining 2 tablespoons oil to the skillet and fry onion, garlic and ginger until onion is soft and golden. Add chili, pepper, turmeric, cumin, salt and the tomatoes. Fry, stirring constantly for 5 minutes. Add yogurt, mint, cardamom and cinnamon stick. Cover and cook over low heat, stirring occasionally until the tomatoes are cooked to a pulp. It may be necessary to add a little hot water if the mixture becomes too dry and starts to stick to the pan.",
      "When the mixture is thick and smooth, add the chicken pieces and stir well to coat them with the spice mixture. Cover and cook over very low heat until the chicken is tender, approximately 35 to 45 minutes. There should only be a little very thick gravy left when chicken is finished cooking. If necessary cook uncovered for a few minutes to reduce the gravy.",
      "Wash rice well and drain in colander for at least 30 minutes.",
      "In a large skillet, heat vegetable oil (or ghee) and fry the onions until they are golden. Add saffron, cardamom, cloves, cinnamon stick, ginger and rice. Stir continuously until the rice is coated with the spices.",
      "In a medium-size pot, heat the chicken stock and salt. When the mixture is hot pour it over the rice and stir well. Add the chicken mixture and the potatoes; gently mix them into the rice. Bring to boil. Cover the saucepan tightly, turn heat to very low and steam for 20 minutes. Do not lift lid or stir while cooking. Spoon biryani onto a warm serving dish."
    ],
    "prepTimeMinutes": 0,
    "cookTimeMinutes": 0,
    "totalTimeMinutes": 0,
    "energyContentCalories": 832.4,
    "fatContentGrams": 35.1,
    "carbohydrateContentGrams": 78.9,
    "proteinContentGrams": 47.8,
    "cholesterolContentMilligrams": 133.8,
    "sodiumContentMilligrams": 1522.0,
    "ingredients": [
      [
        60.0,
        "vegetable oil (mL)"
      ],
      [
        4.0,
        "small potatoes, peeled and halved (unit)"
      ],
      [
        2.0,
        "large onions, finely chopped (unit)"
      ],
      [
        2.0,
        "cloves garlic, minced (unit)"
      ],
      [
        15.0,
        "minced fresh ginger root (mL)"
      ],
      [
        2.5,
        "chili powder (mL)"
      ],
      [
        2.5,
        "ground black pepper (mL)"
      ],
      [
        2.5,
        "ground turmeric (mL)"
      ],
      [
        5.0,
        "ground cumin (mL)"
      ],
      [
        5.0,
        "salt (mL)"
      ],
      [
        2.0,
        "medium whole (2-3/5\" dia) (blank)s medium tomatoes, peeled and chopped (unit)"
      ],
      [
        30.0,
        "plain yogurt (mL)"
      ],
      [
        30.0,
        "chopped fresh mint leaves (mL)"
      ],
      [
        2.5,
        "ground cardamom (mL)"
      ],
      [
        1.0,
        "(2 inch) piece cinnamon stick (unit)"
      ],
      [
        1360.0,
        "boneless, skinless chicken pieces cut into chunks (g)"
      ],
      [
        37.5,
        "vegetable oil (mL)"
      ],
      [
        1.0,
        "large onion, diced (unit)"
      ],
      [
        0.31,
        "powdered saffron (mL)"
      ],
      [
        5.0,
        "pods cardamom (unit)"
      ],
      [
        3.0,
        "eaches whole cloves (unit)"
      ],
      [
        1.0,
        "(1 inch) piece cinnamon stick (unit)"
      ],
      [
        2.5,
        "ground ginger (mL)"
      ],
      [
        454.0,
        "basmati rice (g)"
      ],
      [
        946.0,
        "chicken stock (mL)"
      ],
      [
        7.5,
        "salt (mL)"
      ]
    ]
  }
]